{
  "word": "Alex",
  "short_desc": "Alex noun. Someone that is of extreme greatness. Often considered as a god in some religions. Also means cool.",
  "meaning": "A genuine, but sometimes secretive friend. He is logically oriented and a cunning planner. Although he can easily attain a partner, he usually tends to be a lone wolf because he doesn't believe in a frivolous relationship, and yearns for true love. They tend to not subscribe to the conventions of society, doing what they feel is most entertaining or comfortable. He is self-validated, and a risk taker, although his outward confidence hides a more vulnerable character. True Alex's won't be involved in activities like Football and Lacrosse, the ones who do are usually shorter and less comfortable with their masculinity. Due to their creativity and determination, Alex's are goal-oriented and work tirelessly to reach their long term mission. He loves having fun and will risk embarrassment for a good laugh. He never feels the need to drink or do drugs because he doesn't need them to enjoy life. Overall, Alex's are a constant source of laughs and are exceptionally loyal friends you'd be lucky to have.",
  "example": "\"I hope one day I can marry an Alex.\"",
  "contributor": "SouthernStraw"
}
{
  "word": "Alexis",
  "short_desc": "Alexis a girl who loves to party. best flirt who makes guys drool. not the best at relationships or at spelling. but is the best listener and great at solving problums and weasling out. veeerrry sexual and sexy body with a kicken butt.",
  "meaning": "Alexis is the most gorgeous girl but doesn't believe she is. She is insecure about her body, and worries about how people look at her. She is full of love but can't find the right guy. she is understanding, funny, and caring. She had been threw alot do she knows alot of good advice and on top of that she is usually right. She is kind but can easily be upset. She likes to feel important and be told she is beautiful when she thinks it's not true. She is great in bed once you get her there. She has a beautiful smile but hates it. She likes to party and have a good life. She can be shy but when she knows you she will love you and make you drool. An Alexis is a very good cuddle buddy. Once you have an Alexis never let her go because she may but come back.",
  "example": "Person: Whose that?\rMe: My beautiful, wonderful, caring, sexy, girl friend.Person: Whoa you got yourself an Alexis.",
  "contributor": "Clerkin420"
}
{
  "word": "Amber",
  "short_desc": "Amber An exceptionally attractive pale young woman with beautiful freckles and a divine rack. She is hot beyond this world and is also a fantastic lover.",
  "meaning": "Amber is the most beautiful and kid person you will ever meet. She'll always be there for you, no matter what happens. If you win her heart right, then you'll be able to keep it forever. Never let go of her, because if you do, you'll be losing a lot.",
  "example": "Be like Amber ❤️\r(be perfect)",
  "contributor": "Spengeltron"
}
{
  "word": "Anthony",
  "short_desc": "Anthony  Sexy,Cute and all round smooth talker.   Anthony has been mentioned as one hunk of a Sex God.  Due to this increasingly used term for anyone being good in bed, it has made its self known within the streets! ",
  "meaning": "Anthony is a caring, loving, and loyal person. He knows how to make your day with one sentence, and could cheer you up in a heart beat. You'll never really know how amazing Anthony is unless you talk to him. Many people have made the mistake of not talking to him, and they truly do not know to what extent how amazing he is. Anthony is quiet, and collected. However, if you're his girlfriend, you lucky thing, you'd know just how funny and out-going he can be. You can talk to Anthony about anything, he does not judge and loves you no matter what. He'll always be there for you, because that's in his nature to. He could never be mean without a reason, and even when he is mean, he's almost never harsh with his words. He's a peaceful man, but he loves guns.He's a very humble man, and would never admit to being all these great things. He's perfect. He's the perfect boyfriend, the perfect husband, best friend, anything. He's adorable in every way but very manly. He's a very well balanaced man. His looks equal his personality. He's absolutely handsome, but again, he will never admit to it, because although being very perfect, he is one stubborn man. However, there is no real flaw to him. If you get to know Anthony, and he falls in love with you, you're set for life. Don't ever let go of Anthony, he's yours forever, because he truly loves you.He's a man that goes by the motto, mean what you say, and say what you mean. He's just the total package. Perfection, he is that definition.",
  "example": "Have you seen Rosie and Anthony together?Yes! They're so in love it's adorable!Just like Anthony is!",
  "contributor": "RosenéRawrz"
}
{
  "word": "Ava",
  "short_desc": "Ava Ava is the name of an Amazing girl. This name comes from the Latin origin , and is related to birds , as well as a relation with Eve. If you find a girl with the name Ava , she is probably the most amazing girl you will ever meet . She is perfect in every way , shape and form . Ava has beautiful hair .She has an amazing personality , nice , smart , funny and very athletic. She is also the most beautiful girl , or even sight your eyes will ever see . Ava looks down on herself thinking she is , ugly and stupid though she is none of the above . If you ever meet an Ava do anything possible to bring her in your arms . Never let her go , keep her warm at night , and treat her like what she is , the best girl in the world. Never let her go . I love Ava and hope one day I will be blessed enough to be with her.",
  "meaning": "Ava is the name of an Amazing girl. This name comes from the Latin origin , and is related to birds , as well as a relation with Eve. If you find a girl with the name Ava , she is probably the most amazing girl you will ever meet . She is perfect in every way , shape and form . Ava has beautiful hair .She has an amazing personality , nice , smart , funny and very athletic. She is also the most beautiful girl , or even sight your eyes will ever see . Ava looks down on herself thinking she is , ugly and stupid though she is none of the above . If you ever meet an Ava do anything possible to bring her in your arms . Never let her go , keep her warm at night , and treat her like what she is , the best girl in the world. Never let her go . I love Ava and hope one day I will be blessed enough to be with her.",
  "example": "Guy 1 - I think im in love with her , she is perfect .Guy 2 - Thats Ava",
  "contributor": "YoBoiWill"
}
{
  "word": "Asshole",
  "short_desc": "asshole Your current boss.",
  "meaning": "A person who is intentionally cruel, obnoxious and heartless. Assholes are most often male. A female who follows these traits is referred to as a bitch. Assholes can take any form. Knowing this allows you to spot assholes at any time or place.Be warned that an asshole is not synonymous for douchebag. A genuine asshole is the lethal combination of intelligence and arrogance. Assholes will attempt to humiliate you, and unfortunately, they generally succeed due to their intelligence. Douchebags, on the other hand, consist of only arrogance. They only think they are smart. Douchebags do not know they are douchebags because of their extreme egotistic tendencies. However, the asshole will always know they are an asshole.Though the appearance of assholes does not follow a stereotype, behavior does. Assholes tend to:\r-ENJOY NOTHING MORE THAN BEING AN ASSHOLE.\r-Smirk. A lot.\r-Argue for the sake of arguing.\r-Laugh when they win an argument.\r-Never let you hear the end of the argument they won.\r-Participate in arguments they know they are not going to win.\r-Not stop arguing until you give up because there's no point in arguing anymore even though you know you won.\r-Associate your giving up with their victory.\r-Point out every flaw your argument has, regardless of the subject. All the asshole cares about is making people look stupid.\r-Physically push you around to get under your skin.\r-Ambiguously answer your questions.\r-Deny that they are assholes out loud.",
  "example": "\"Wow. Max just argued unintelligently with me for an hour and a half and he thinks he won.\"\r\"Jeez, what an asshole.\"",
  "contributor": "darthdragongirl"
}
{
  "word": "Alyssa",
  "short_desc": "alyssa the kind of girl who still manages to find a way to smile; the one that you&apos;ll see walking down the hallway, having her head up high, trying just one last time; the kind of girl that will get back up, each andeverytime she falls... the kind of girl who NEVER gives up. ",
  "meaning": "Alyssa is the most amazing girl you will ever meet. She’s the sweetest person you ever meet and will respect you the same way you respect her. Every time you look at her in the eyes you will get lost and it’s like looking in to space. She will always make you happy in every way and will always help you from having a bad day to a really great day. She will always be there for you no matter day and night, she will support you throughout everything and encourage you.",
  "example": "Have you seen Alyssa, I literally got lost in her eyes.",
  "contributor": "Master^.^Yoda"
}
{
  "word": "Ashley",
  "short_desc": "ashley a bad ass motherfucker who who won&apos;t take no shit off of nobody",
  "meaning": "Ashley is very intelligent, caring, artistic, beautiful, loyal human being. She can be shy when you first meet her, but opens up when you get to know her. An Ashley would do anything for her friends. Don't get on her bad side though, she can be a bit stubborn. Ashley is an overall great person. If you are lucky enough to have an Ashley in your life, become as close as you can with her. You won't regret it.",
  "example": "I wish I could be more like Ashley.",
  "contributor": "uniquxx"
}
{
  "word": "Andrew",
  "short_desc": "andrew Ultra cool, Usually hot or at least sort of cute. Awesome sense of style, music, and humor. Sexy, awesome kisser",
  "meaning": "t is Greek origin, and the meaning is \"man, warrior\". Andrews are athletic and knowledgeable and sometimes act shy and reserved but are really out going and crazy when you get to know them. They like computers and comics/super heroes just as much as they like sports, they are the best of both worlds. Andrews will be there when you need them, but you have to be there for them at the same time. If you are lucky enough to be friends with an Andrew you are in for a wild ride. Once you meet him, you will never forget him. Andrews are also quick on their feet and always have a come back ready for you..so be prepared. Sometimes Andrews have ego issues, they like to be the best and are extremely stubborn. They will make you laugh and make you cry, but you will always forgive an Andrew no matter what. Also they like fast cars. And drifting. Andrews will scare you shitless. If you ever meet an Andrew you will find out real quick that they are insanely hyper and visit the hospital a lot. Be ready you will probably be in a waiting room fo' eva. If you ever date an Andrew he will act like he isn't a good boyfriend or isn't good at dating, but really he is amazing, and is as close as a guy can get to perfect..as well as an amazing kisser. And most importantly if you ever fall in love with an Andrew you will always remember the time you spent with him, because Andrews will leave a mark on your heart that will never go away. Never let an Andrew go. You are insanely lucky to meet an Andrew.",
  "example": "Andrew is ermahgerd amazing!",
  "contributor": "ErmahGeRd"
}
{
  "word": "Amy",
  "short_desc": "amy to take, hold, or steal your heart. a person who is a soulmate. a good lover.",
  "meaning": "Amy is a girl that will fight until she's right, but still is kind hearted. She's the type of girl that doesn't think or relieve she's beautiful.",
  "example": "Boy: Hey there Amy\rAmy: HiBoy: You look great today\rAmy: Thanks, I guess ...",
  "contributor": "The_Cool_grl"
}
{
  "word": "andrea",
  "short_desc": "andrea Andrea comes from the Latin meaning &quot;Womanly&quot; or &quot;Beautiful Lady&quot;. She is steadfast and confident,honest and reliable.A tower of strenth for thoughs she cares for and a rock to the family.",
  "meaning": "Andrea can be shy and quiet but then she will make you laugh every single second she is very precious and is a very {beautiful} girl She’s the most {humble , loving and , caring person you can ever find you can do her wrong so many times and she will always be there for you helping you out giving you the best she can , even when she’s going through many things herself she will make you the {happiest} , she doesn’t know how beautiful she is , she has the most {gorgeous} {eyes}that you’ll just get lost in they will make you fall Inlove so easily , her smile is the prettiest that it’s so contagious that smile is surely unforgettable. she likes being away from any thing that does not include good and has the most amazing personality ever her soul and mind are just full of unsaid thoughts and emotions shes very trustworthy and loyal .she’s very {different} just unique from any other girl keep in mind she’s someone you won’t want to lose she’s just special . Andrea is a {independent} girl she can’t fall Inlove easily unless you’ve really got her heart but with or without you she will be {successful} in everything that she has {passion} for .she is a hard worker and can do it with or without anyone . She has an amazing body aswell she’s just {stunning} inside and out everything about her will make you go crazy. Her {imperfections} make her {perfect} . She’s a {little nerd} she has everything planned out before time , but sometimes she can’t choose she’s very {picky} at times.",
  "example": "Andrea is really beautiful isn’t she anyone will be the luckiest to have her",
  "contributor": "Jamssonn"
}
{
  "word": "apple",
  "short_desc": "apple THE MOST BADASS FUCKING FRUIT ON THE FUCKING PLANET. SERIOUSLY, THIS MOTHERFUCKER KICKS THE SHIT OUT OF THE PUSSY ORANGE OR BANANA. THIS JUICY, RED MOTHERFUCKER IS THE BEST FUCKING THING THAT GOD HAS EVER CREATED. EAT AN A APPLE AND YOUR DICK WILL GROW 3 INCHES. FUCK.",
  "meaning": "THE MOST BADASS FUCKING FRUIT ON THE FUCKING PLANET. SERIOUSLY, THIS MOTHERFUCKER KICKS THE SHIT OUT OF THE PUSSY ORANGE OR BANANA. THIS JUICY, RED MOTHERFUCKER IS THE BEST FUCKING THING THAT GOD HAS EVER CREATED. EAT AN A APPLE AND YOUR DICK WILL GROW 3 INCHES. FUCK.",
  "example": "Woah, look at that badass over there eating an apple",
  "contributor": "beaverbounce"
}
{
  "word": "Angel",
  "short_desc": "angel The girl who makes your heart jump when she enters the room. The girl who breaks it as she leaves.  The girl you&apos;ll need for a long time, wherever you go.",
  "meaning": "Angel; it makes total sense why she’s been given that name. because, she's Angelic. A one-of-a-kind type of girl. She’s very deep in her emotions but in a kind of beautiful way. She makes everything look so beautiful. Angel is truly gifted at writing, she can write about anything and make it sound amazing. Once you become close friends to her, you'll get to meet one of the best sides to her. Her wild side. She seems so innocent when you first meet, but she turns out to be one of the dirtiest people you know. She has emotional issues and sometimes even depression, but she’s ALWAYS nice. Angel’s one of the most beautiful girls you could ever come across. She is so quickly lovable, that you'll get mad at yourself for not becoming her friend. And just like a flower blooming, her cleverness overpowers everything else. not just school smart but just knowledge smart. She knows a lot of things other people wouldn't have a clue about. Although she feels these horrible feelings about herself, she isn’t attention seeking. Which makes her even more perfect. She is beauty inside and out. She’s very knowledgeable in everything. Art, music, English, writing, sport, makeup, making friends and just knowing what to say. She can make you feel everything at once. She has so much love to give out to the world, it's literally pouring out of her. Angel, if you are reading this YOU ARE SO BEAUTIFUL. I love you.",
  "example": "One's Truest Beauty = Angel.",
  "contributor": "areyougonnafinishthatcrossiant"
}
{
  "word": "Austin",
  "short_desc": "Austin noun; adjective; verb. noun: a very handsome man; a very cute man; a fun loving guy; a genuine ladies man; a funny guy; a guy with many talents; a guy with an average but satisfying penis; a guy who can, even when your angry, cheer you up; A sweet guy; a straight guy; a deep guy; a guy who is amazing in bed; a guy who can be an asshole sometimes; a guy who normally does stupid things; A phenomenal kisser;   adjective: being funny; being sweet; being straight; not being able to jump high; being stupid; being charming;  verb: running fast; masturbating slow; jumping low; sweet talking; telling jokes; acting like an ass;  eating; pooping; having sex; ",
  "meaning": "A sweetheart of a guy who can light up anyone's day with his jokes. Austin may not be the most popular guy but is definitely the coolest. He's easy going, easy to talk to, funny, cute, incredibly fit, smart and wise beyond his years. He's a little shy but insanely outgoing around his friends. He can make anyone laugh, knows how to treat a girl right and is loves cuddling. He genuinely cares about everyone he loves and loves everyone. If you get to really know him you'll realize he's a deep, insecure and one of the most amazing friends you will ever make in your entire life. He'd make the most amazing boyfriend in the history of man-kind He's also incredibly brave and isn't afraid to fight for what he believes in or wants. If you ever have the privileged to have him in your life don't take it for granted and never let go of him as a friend or anything else. He knows what to say, when to say it, and how to say it. He's a good listener and gives the best advice. He never judges or makes you feel like you're nothing. He has the most beautiful blue eyes you've ever seen and is the easiest person to love ever. He's pretty much every girl's dream guy and more. Incredibly rare down to earth human being and is just plain awesome. Words can't describe this dude.",
  "example": "Girl1: I need a guy who can always be there for me and really cares...Girl2: Giiirrrrlll get cho' self an Austin!!",
  "contributor": "diamondeyedcanadiangirl"
}
{
  "word": "ass",
  "short_desc": "ass (_!_) = Normal Ass (__!__) = Big Ass (!) = Tight Ass (_?_) = Dumb Ass (_E=MC2_) = Smart Ass (_$_) = Rich Ass (_x_) = Kiss My Ass (_X_) = Get Off My Ass ",
  "meaning": "(_!_) = Normal Ass\r(__!__) = Big Ass\r(!) = Tight Ass\r(_?_) = Dumb Ass\r(_E=MC2_) = Smart Ass\r(_$_) = Rich Ass\r(_x_) = Kiss My Ass\r(_X_) = Get Off My Ass\r",
  "example": "",
  "contributor": "Assholes Inc."
}
{
  "word": "America",
  "short_desc": "America A country that claims the name of an entire continent to itself alone for no compelling reason.",
  "meaning": "1 America – a country that has leapt from barbarism to decadence without touching civilization. John O'Hara and he was an American.\r2 America has progressed from barbarism to decadence without the intervening stage of civilization. George Bernard Shaw\r3 America is the only country that went from barbarism to decadence without civilisation in between. Oscar Wilde.\rNumerous other people have been credited with expressing that sentiment or something similar including Henry James, another American. However, in all probability the phrase originates with Georges Clemenceau when he was President of France.",
  "example": "America, so many people seem to dislike you.",
  "contributor": "AKACroatalin"
}
{
  "word": "Arthur",
  "short_desc": "Arthur The most amazing, caring, intelligent, cute, thoughtful, smart, funny, fun, affectionate, and sweet person you will ever meet in your life. He will always go out of his way to make sure that you are the happiest you can possibly be. He says the sweetest things and keeps you smiling 24/7. Good luck getting him off your mind, cuz that&apos;s impossible. When he kisses you, you feel like no one else exists and you&apos;re the only thing that matters to him. When he hugs you, he does it so tightly, you never wanna let go. You could stare at him all day long and never want to stop because he&apos;s just that cute. Everything he does and says will make your heart smile. He has no idea how amazing he actually is though, so make sure you tell him. And next time he takes you to look at stars, make sure you find the courage to tell him you love him. You don&apos;t ever wanna lose him. He will be the most important thing in your life, and you&apos;ll never be happier than you are with him.",
  "meaning": "The kind of guy you write urban dictionary words about lol. He's funny, caring, sweet, smart, altruistic, and simply incredible. He usually takes a long time to open up to you, but when he does, you see even more amazing sides to him. Whenever you're with him, the entire world disappears. He's passionate about what he loves and who he loves and everyone he talks to adores him. Not only is he a one-of-a-kind friend, he is also the best guy you will ever meet. The impact that he will leave on you and your life is irreplaceable and if you meet an Arthur, make sure to never let them go.",
  "example": "Lol Arthur I wonder if you'll see this.",
  "contributor": "0822"
}
{
  "word": "Ayla",
  "short_desc": "ayla Ayla is just one of those girls.. one of those girls who can make you laugh (even when you shouldn&apos;t), dance (even when you can&apos;t), be a little crazy (even when you&apos;re the shyest person in the world) and in all reality, just bring out the best in people.",
  "meaning": "Ayla is a strong, independent, caring, animal loving, generous, kind-hearted girl, she can be boring but opens up real easily to friends. She is usually used to being betrayed or used by others and sometimes insecure. Ayla is a very creative, and can make anyone laugh. They don't like being messed with, if you do mess with her... oh you're gonna have a tough time. If you move or leave, Ayla with never forget you no matter what. They can really make good stories and are usually day-dreaming a lot. An Ayla is very social, but when she's at a new place she isn't really at first. If she sees anyone getting bullied, she always tries to interfere and is never a bystander. An Ayla usually has trust issues due to being betrayed, if you earn her trust and somehow break it, it's almost impossible to gain back. An Ayla has a lot of people that have a crush on her but she doesn't like them back, when she finds someone she's not sure what she sees in him/her. An Ayla doesn't believe in her beauty, and tells people she's not \"beautiful\" or talented. An Ayla has a hidden talent but doesn't like expressing it. An Ayla is a fantasy believer and has seen rare sights that others haven't. If you are friends with an Ayla and have her trust you are very lucky, you might not know it but you are.\rI know all this info because I am an Ayla, all these things I typed are true, I've been betrayed many of times, I have stage fright but I'm good at singing, and I don't believe in my beauty...",
  "example": "Thanks for defending me, Ayla\rAyla that picture is awesome!\rHey Ayla! What have you been up to lately?",
  "contributor": "LexyWolfTamer"
}
{
  "word": "Aubrey",
  "short_desc": "Aubrey Words can not describe how amazing Aubrey is. She is smart, talented, funny, and just plain beautiful. She is always fun to talk to and you can always joke around her. She is very athletic and has an amazing body.",
  "meaning": "Aubrey is the sweetest girl you will ever meet. She is amazing and beautiful and everything you could ever want in a girl. Aubrey is 100% perfection. Once you have her you won’t want to leave her. she is sometimes way to hyper and crazy but it makes for a good time and things are never boring around her. Aubrey is so funny and chill. She is a bit boy crazy but guys love her. She is so athletic and her body is crazy amazing but she is way more beautiful on the inside and her personality is the greatest of anyone i’ve ever met. there is no one like aubrey.",
  "example": "Aubrey just walked past me!\rDid you ask her out yet?\rNah...she makes me nervous she’s so beautiful.",
  "contributor": "joeyismydad"
}
{
  "word": "Aliens",
  "short_desc": "Aliens People from outerspace.  Generally peace loving and wise, they&apos;ve come to Earth because we&apos;ve got velcro and they love that shit",
  "meaning": "People from outerspace.  Generally peace loving and wise, they've come to Earth because we've got velcro and they love that shit",
  "example": "I've got some Aliens living in my basement",
  "contributor": "Quicksand Jesus"
}
{
  "word": "Adult Swim",
  "short_desc": "Adult Swim Place were great cartoons like The Family Guy and Futurama and much anime hands out. Fun to watch, if you like cartoons but don&apos;t want lots of little kiddie crap on these days.",
  "meaning": "Place were great cartoons like The Family Guy and Futurama and much anime hands out. Fun to watch, if you like cartoons but don't want lots of little kiddie crap on these days.",
  "example": "Futurama and The Family Guy made nothing on FOX, but on ADULT SWIM they're making more money than ever.",
  "contributor": "Trogdor the Burninator"
}
{
  "word": "ADHD",
  "short_desc": "adhd ADHD stands for attention deficit somethingk.  Hey! I spelled something wrong.  Haha.  Hey look a squirrel.  Wait, what am I doing here again?  Omigawd my elbow itches.  Wonder what&apos;s on tv?  I like Jennifer Lopez.  I hate kumquats.  I really love urbandictionar.....where was I again?",
  "meaning": "A disorder related to hyperactivity and distraction.I have it, and I know I'm not an expert. I'm just saying, I speak from experience when I say it's freaking hard to get one thing done all at once. You usually get distracted by something else, and then eventually come back to that first task.\rThis doesn't mean you can't get something done, it just means that work typically takes a lot longer because you're inclined to go look something up or do something RIGHT that second. Hell, I'm procrastinating right now making this definition when I'm supposed to be doing biology homework.I shouldn't even have to acknowledge these people, but to everyone who thinks that all people with ADHD are stupid are seriously wrong. Most people with ADHD are gifted.",
  "example": "Sometimes when you go out to night parties after your meds have worn off, you act hyper without noticing it. But it's fun hyper, not annoying hyper. At least that's what my friends tell me ;)\rAnyway, sometimes the next day when you're on your meds again, you just remember glimpses of the previous night because everything was a big distracting, stimulating blur.\rOh, \"ADHD\". my example has to include the word apparently.",
  "contributor": "Ruthie476293475."
}
{
  "word": "arse",
  "short_desc": "arse The word for a persons rear end spoken by people who use correct english",
  "meaning": "The word for a persons rear end spoken by people who use correct english",
  "example": "Americans are so dumb that they cannot pronounce a word in their own language.\rThey say 'ass' for 'arse'\rAss is a synonym for Donkey. Poor Donkey!",
  "contributor": "totem_pole"
}
{
  "word": "AFI",
  "short_desc": "AFI 1) A rock band that originally formed in 1991, has become more well known after releasing their &quot;Sing The Sorrow&quot; CD. Much of their music is calming, and deeply poetic. The other half sounds more punk.   Because of this many people see them as an emo band, now based on a couple songs that they heard on the radio. AFI isn&apos;t exactly punk, and it isn&apos;t emo.  It&apos;s just... AFI. Who cares what scene they belong to? They have a unique touch and if you&apos;re into stuff with meaning than it&apos;d be worth your time to try AFI.   AFI stands for &quot;A Fire Inside.&quot;   2) People hate AFI and sometimes refer to it as &quot;emo,&quot; it attempts to look hardcore and cool. ",
  "meaning": "1) A rock band that originally formed in 1991, has become more well known after releasing their \"Sing The Sorrow\" CD. Much of their music is calming, and deeply poetic. The other half sounds more punk. \r\rBecause of this many people see them as an emo band, now based on a couple songs that they heard on the radio. AFI isn't exactly punk, and it isn't emo.\r\rIt's just... AFI. Who cares what scene they belong to? They have a unique touch and if you're into stuff with meaning than it'd be worth your time to try AFI. \r\rAFI stands for \"A Fire Inside.\" \r\r2) People hate AFI and sometimes refer to it as \"emo,\" it attempts to look hardcore and cool. ",
  "example": "1) AFI rocks. Have you heard their song Morningstar?\r\r2) \"Lol I hate AFI. HATING A BAND MAKES ME SO COOL. I hate you emos. Hahahaha.\" Really the people that pretend to hate bands are the most emo of all. XD \r\r",
  "contributor": "NattyWolf"
}
{
  "word": "Ari",
  "short_desc": "Aris Aris is a very rare name. People with the name &quot;Aris&quot; are most often female, that is why meeting a male named &quot;Aris&quot; is quite a spectacle. You should never let go of a person named &quot;Aris&quot;. Keep them close to you and never let them go. They are the most understanding people in the world. They have kind hearts and often put others before themselves. They are very generous and forgiving. They are intelligent, cunning, hot, handsome/beautiful, sexy, cool, good dressers, give good hugs, and good with words. They are often serious and give off the first impression of being rather boring, but they are the most interesting once you get to know them. They know how to make you laugh even when you are sad and are the most caring individuals. They are also master at easing situational tension by humiliating themselves to make everyone happy. They are good at analyzing situations and thinking on their feet. They are the best listeners and advice givers. Good at sports, but the best in bed. They also have very kind eyes and a gentle touch that gets anyone to feel loved. They are most often very slender and petite, and look rather weak.",
  "meaning": "People with the name \"Ari\" are most often female, that is why meeting a male named \"Ari\" is quite a spectacle. You should never let go of a person named \"Ari\". Keep them close to you and never let them go. They are the most understanding people in the world. They have kind hearts and often put others before themselves. They are very generous and forgiving. They are intelligent, cunning, hot, handsome/beautiful, sexy, cool, good dressers, give good hugs, and good with words. They are often serious and give off the first impression of being rather boring, but they are the most interesting once you get to know them. They know how to make you laugh even when you are sad and are the most caring individuals. They are also master at easing situational tension by humiliating themselves to make everyone happy. They are good at analyzing situations and thinking on their feet. They are the best listeners and advice givers. They have very kind eyes and a gentle touch that gets anyone to feel loved.",
  "example": "\"Ari can also fix the situation\"",
  "contributor": "PostiveVibes"
}
{
  "word": "American Idiot",
  "short_desc": "American Idiot (1) A 2004 [Green Day] album which serves as a rock opera that tells the story of a few average American youth living in a metropolis of rhetoric, lies, and censorship. The album tells the story, which takes place in the time span of about one year, through exploring the thoughts of each character as well as through dialog and interactions between the characters. While the plot is more of an abstract concept than it is a direct story, the message is fairly clear: the American youth remain unheard because of the &quot;I don&apos;t care&quot; attitude many of them carry, but because of the lack of actual dialogue, the root of this attitude is the fact that the American youth only know what they DON&apos;T want, and have never been presented with a reasonable option that they COULD want. Of course the ending of the story is, unfortunately, also an all-too-common reality in our current world.  The album/story also tells a typical teen-angst-style love story that applies a double meaning to the cover (which is a hand holding a heart-shaped grenade).  The album is expected to receive negative criticism (especially by those who don&apos;t take the time to truly understand the story or are too quick to judge and disregard it as &quot;left-wing propaganda&quot;), since it was considered a highly experimental concept from the very beginning. Others simply don&apos;t like it because of its difference from the typical Green Day style, but many see this as a refreshing and much-needed break. Love it or hate it, &quot;American Idiot&quot; is Green Day&apos;s first new release full-length album since 2002.  (2) The title track from the above-mentioned CD.",
  "meaning": "(1) A 2004 Green Day album which serves as a rock opera that tells the story of a few average American youth living in a metropolis of rhetoric, lies, and censorship. The album tells the story, which takes place in the time span of about one year, through exploring the thoughts of each character as well as through dialog and interactions between the characters. While the plot is more of an abstract concept than it is a direct story, the message is fairly clear: the American youth remain unheard because of the \"I don't care\" attitude many of them carry, but because of the lack of actual dialogue, the root of this attitude is the fact that the American youth only know what they DON'T want, and have never been presented with a reasonable option that they COULD want. Of course the ending of the story is, unfortunately, also an all-too-common reality in our current world.\r\rThe album/story also tells a typical teen-angst-style love story that applies a double meaning to the cover (which is a hand holding a heart-shaped grenade).\r\rThe album is expected to receive negative criticism (especially by those who don't take the time to truly understand the story or are too quick to judge and disregard it as \"left-wing propaganda\"), since it was considered a highly experimental concept from the very beginning. Others simply don't like it because of its difference from the typical Green Day style, but many see this as a refreshing and much-needed break. Love it or hate it, \"American Idiot\" is Green Day's first new release full-length album since 2002.\r\r(2) The title track from the above-mentioned CD.",
  "example": "(1) My friend Joe told me not to waste my money on American Idiot, while my friend Sally said that it's her favorite Green Day album ever. I'm not sure who to believe on this one.\r\r(2) \"Don't want to be an American Idiot / One nation controlled by the media / Information age of hysteria / calling out to Idiot America\"",
  "contributor": "paul4tA"
}
{
  "word": "Anastasia",
  "short_desc": "anastasia an extremely goddess like figure who boys will line up to tie her shoes for her. She has an amazing death stare and will not put up with being called a priss. Because she is a GODDESS",
  "meaning": "Perfect in every way possible, an Anastasia will always be there for you, she's caring, funny, considerate, and drop dead gorgeous. If you ever get the chance to date an Anastasia, don't ever let her go. Anastasias tend to get hurt but are very forgiving and understanding. Love them as much as possible",
  "example": "Guy1: Hey how was your date with Anastasia?Guy2: Incredible, I think im in love dudeGuy1: Don't fuck up you know what she's been through",
  "contributor": "QuapooTheG"
}
{
  "word": "Aeropostales",
  "short_desc": "Aeropostale First I just want to say if people have nothing to do then bash Aeropostale then maybe you should go get a life. Second how can you say Aeropostale is a store for prep wannabes when that’s basically what A&amp;F and AE are. Although you can find many preppy items at these stores they are not preppy. The real prep brands are Polo Ralph Lauren, Lacoste, IZOD, Lily Pulitzer, Brooks Brothers, Patagonia, etca. Being preppy is not going to Abercrombie and buying a $40 XS shirt that makes you look like a skank it’s about dressing nicely and being classic and conservative. Aeropostale is just another teen retailer that sells stylish clothes for good prices.",
  "meaning": "Noun.1. a group or \"flock\" of preps who share similar values and over pay for brightly coloured clothing bearing the \"aeropostale\" logo. they are occasionally seen wearing other brand names such as holister or abercrombie. aeropostales can usually be found around the volleyball court, flirting with teachers, listening to radio music or flinching at dirty jokes",
  "example": "\"Look, there go the aeropostales!\"\"Woah, they exist outside the mall?!\"\"I guess daddy's credit card got cancelled\"",
  "contributor": "David Berkowitz :)"
}
{
  "word": "Abercrombie & Fitch",
  "short_desc": "abercrombie A clothing store that is so expensive that gift certificates make you pay extra for the clothes you buy. The company will, in many cases, &quot;pre-wrinkle&quot; the shirts for you. Jeans can also be purchased with a holes already in them. The clothes feel, oddly enough, like they&apos;ve already been used.",
  "meaning": "A usually overpriced store with a huge lack in lighting, and should be sued for air pollution.",
  "example": "Person: Hi, welcome to Abercrombie & Fitch, would you like a flashlight and a gas mask?",
  "contributor": "Winxx"
}
{
  "word": "Angelina Jolie",
  "short_desc": "Angelina Jolie the most beautiful, hottest, and sexiest person alive. her lips are like pillows. she is also one of the kindest and most determined people in the world. She also represtents the United States as a UN Ambassador.",
  "meaning": "Angelina Jolie is simply said, perfection. But there is nothing simple about this goddess that walks the earth. From her stunning lips to her amazing body, she represents perfection as a human being. She received international stardom for her roles in the Tomb Raider movies and rightly so. She has somewhat accelerated her movie career whilst caring for her adopted children and the child she has with Brad Pitt (luckiest man in the world).",
  "example": "\"Wow, that was perfection, just like Angelina Jolie.\"\r\r\"This movie needed more Angelina Jolie.\"\r\r\"Angelina Jolie - 'nuff said.\"",
  "contributor": "The Great Kraken"
}
{
  "word": "AA",
  "short_desc": "AA The place to go if you have ever: pissed your pants; wrecked your car; been arested for multiple DUI&apos;s; passed out outdoors; urinated in an interior corner or plant; hid beer for &quot;later&quot;; drank alcohol you think is foul because there is nothing else; thought hair of the dog is a good idea; lost a weekend; called up your friends to piece together why you are home without your pants; missed Thanksgiving or Christmas dinner by accident; been fired &apos;cause you are too drunk/hungover to got to work; woke up wondering who is sleeping next to you; intend to drink a cocktail and ended up drunk, and; you sincerely cannot stop drinking but don&apos;t want to live a miserable life.",
  "meaning": "The place to go if you have ever: pissed your pants; wrecked your car; been arested for multiple DUI's; passed out outdoors; urinated in an interior corner or plant; hid beer for \"later\"; drank alcohol you think is foul because there is nothing else; thought hair of the dog is a good idea; lost a weekend; called up your friends to piece together why you are home without your pants; missed Thanksgiving or Christmas dinner by accident; been fired 'cause you are too drunk/hungover to got to work; woke up wondering who is sleeping next to you; intend to drink a cocktail and ended up drunk, and; you sincerely cannot stop drinking but don't want to live a miserable life.",
  "example": "Dude...ever since Mike's gone to AA I can keep my beer in the fridge and I don't have to worry about him watering the ficus tree.",
  "contributor": "miguelito"
}
{
  "word": "Avatar",
  "short_desc": "Avatar A long ass movie that was basically Pocahontas played by Halo characters.",
  "meaning": "A long ass movie that was basically Pocahontas played by Halo characters.",
  "example": "\"What did you think of Avatar?\"\"It was 3 hours of predictable Pocahontas/Halo garbage.\"",
  "contributor": "Clint Bubbles"
}
{
  "word": "apple computer",
  "short_desc": "apple computer thread on urbandictionary.com used by geeks to insult each other",
  "meaning": "thread on urbandictionary.com used by geeks to insult each other",
  "example": "apples are shit blah blah...\rno theyre not blah blah...",
  "contributor": "oracle"
}
{
  "word": "annoying",
  "short_desc": "annoying Me, see example for reason.",
  "meaning": "Me, see example for reason.",
  "example": "I once woke up my mate at 12:00AM to show him my completed rubiks cube!",
  "contributor": "JayGee"
}
{
  "word": "Aisha",
  "short_desc": "Aisha A beautiful and intelligent girl with an innocent heart. She is quite and shy at first but crazy once she’s comfortable with you. Always laughing and will always cheer you up. A pure and loving soul with an amazing smile :)",
  "meaning": "A beautiful and intelligent girl with an innocent heart. She is quite and shy at first but crazy once she’s comfortable with you. Always laughing and will always cheer you up. A pure and loving soul with an amazing smile :)",
  "example": "Never lose an Aisha from your life!",
  "contributor": "*$#%"
}
{
  "word": "AIM",
  "short_desc": "AIM n. - An Internet text messaging program that exchanges communications between users in real time, and allows college students to leave nifty online &quot;away&quot; messages for their buddies all day.  v. - to AIM someone is to send them a message using the AIM program. ",
  "meaning": "n. - An Internet text messaging program that exchanges communications between users in real time, and allows college students to leave nifty online \"away\" messages for their buddies all day.\r\rv. - to AIM someone is to send them a message using the AIM program. ",
  "example": "\rI used AIM to ask Sheila out on a date.\r\rSheila AIMed me back to tell me no.",
  "contributor": "b-diddy"
}
{
  "word": "Arielle",
  "short_desc": "arielle an amazing girl who just makes you smile :o) shes gorgeous and doesnt like being shy even though its the cutest thing ever! she doesnt think that any guys like her but she is mistaken, i mean who wouldnt love arielle?",
  "meaning": "Arielle is the best out of the best . she’s an outgoin, funny, beautiful and loving girl. If have an “Ari” or “Arielle” DO NOT lose her !! her smile is contagious and can light up your world . Her voice is soothing and calming . she’s a very funny girl and will make you feel cared for . She is very very very very loyal, she always puts her friends first . and she loves her bestfriends and all titles unconditionally. she’s lit asf and make ur day a whole lot better . she’s so fine, and beautiful it’s unbelievable! she can be a little clingy sometimes, but she’s just showing you love . she’ll fight for any of her friends no matter what terms . all in all, arielle is rare, don’t lose her !",
  "example": "Arielle looks so pretty today",
  "contributor": "a..nonymous."
}
{
  "word": "Ali-A",
  "short_desc": "alia by far, the most beautiful woman ever to exist",
  "meaning": "This man is the star of many twelve year olds wet dreams, and the king of clickbait, people who reject this definition are most likely his twelve year old fan boys",
  "example": "Me: Check out Ali-A's newest video\rHim: It's just a bunch of clickbait",
  "contributor": "ARKA35"
}
{
  "word": "Axl Rose",
  "short_desc": "Axl Rose A great frontman for the great rock band, Guns N&apos; Fucking Roses. Unfortunately, he became a meglomaniac cunt who drove the rest of the band apart and replaced them with a bunch of nobodies. Having fallen far from his former greatness, he should be shot. Multiple times.",
  "meaning": "Victim of the one of the most gut-wrenchingly extreme cases of LSD (Lead Singer's Disease) in recorded history.\r\rAxl Rose was the lead singer of the hard rock group Guns N' Roses during the mid '80s and early '90s.  Following the release of GNRs debut album \"Appetite for Destruction\", the rapid increased in attention the band received caused a devastating expansion in Axl's ego that his tiny brain was unable to contain.  A massive, never ending stream of inane bullshit began to spew from Axl’s mouth as he tried to relieve the growing pressure.   \r\rEventually all other members of GNR left the band as they were fired or (gladly) quit in order to escape from the Axl Rose fag show.  Axl then began a process of rapidly hiring and firing members of GNR as he desperately tried to maintain his delusion that GNR was still a legitimate band and that he was still in some way relevant.  The name of GNRs album “Use Your Illusion” is a subliminal reference to this effort.\r\rTechnically, GNR never did disbanded and Axl has been working on the band's next album for the last 75 years or so.  No one cares.\r",
  "example": "Man, it's hard to believe that Axl Rose once managed to get along with other human beings long enough to put out an album.",
  "contributor": "amoebabadass"
}
{
  "word": "Alina",
  "short_desc": "Alina By far the reason why i am the luckiest guy in the world!",
  "meaning": "If you got yourself an Alina you are by far the luckiest guy in the world,she's radiant and you would do anything to see her smile.\rAlina's are highly gifted, spiritual, creative,talented and very beautiful creatures,she shines out life,light,joy,love and has everything to do with beauty radiating from the inside and out.\rShe is the one to go to when comfort, advice is needed or a helping hand.\rAlina's love chocolate, originality, nature, stargazing and readingAlina cries only at night alone or to the one she wants to be at her weakest with,if you are very that person consider yourself lucky.Never lie to an Alina. You will deeply regret it.\rOnce an Alina is hurt, she forgives but never forgets, the hostility will always be there unless you try really hard to show her that you want to be on her best side.\rDo not fight with an Alina,she can be a riot, is wise and has a way with words.\rAlina is an observer, so if you think you are observing her she is in fact observing you.\rAlina's have a hard time controlling their temper once you have stepped on their toes.their words are harsh and can make you or break you,which is her biggest flaw.\rAlina's intimate moments are extremely hot,wild and sexy,she bites and scratches at times.\rIf you have an Alina show her off.\rtreat her right and love her with everything you've got because i lost my Alina,the sunshine left my life.My life is dark now.<For short: Alina is a cousin of god, hold on to your Alina like sunlight>",
  "example": "Cory: Hey look there's Alina\rEric: My day just got alot better man\rCory: You like her? Does she know?\rEric: No, not yet. She'll be my wife one day\rCory: Damn now i got competition",
  "contributor": "Surfboy23"
}
{
  "word": "Alexia",
  "short_desc": "Alexia The most awesome girl you will ever meet.Really pretty, and classy. ",
  "meaning": "An intelligent and beautiful girl who feels insecure about what the world may think of her. She tries her hardest not to make mistakes and is a good, well- rounded person. Her grades are excellent and sometimes dedication to her studies makes her seem as less sociable and unusual even though she tries hard to make friends and have fun. She is curious and has a deep heart, and waits for the right guy to come around so that she could have a long lasting and real relationship with him. Although they may not seem like it at first, Alexia's are trustworthy, loyal, intellectual, and beautiful people that will amaze you once you get to know them more. You are lucky if you are close friends with an Alexia because they are people who you can turn to and laugh with whenever you need them and are very dedicated to anything they want to achieve.",
  "example": "I want a girlfriend who is pretty, loyal, and smart like Alexia!",
  "contributor": "Crystalizer101"
}
{
  "word": "Anal sex",
  "short_desc": "anal sex this is like, sex in the butt.",
  "meaning": "When This (__*__) gets penetrated by This <==3\rand ends up like this (__Q__)\rPlease don't remove the spaces!",
  "example": "This! (___(=3__)\r-------\\--- /\\--- /\r--- ----|---| |---| Ehh? You get the point! Anal sex image!",
  "contributor": "TheButtler"
}
{
  "word": "AC/DC",
  "short_desc": "AC/DC The greatest Classic Rock band to walk this planet. The lead guitarist is Angus Young. His brother, Malcolm on the rythem guitar, the leadman is Brian Johnson. They are the best of the best.",
  "meaning": "A rock band from Australia. It has been disputed exactly what genre of rock music AC/DC is, but wheather they're Classic Rock, Heavy Metal, Punk Rock, or whatever, AC/DC is one of the greatest rock bands of all time. AC/DC has been considered one of the founders of heavy metal, along with bands like KISS and Led Zeppelin. In 1974, AC/DC recruited lead singer Bon Scott, and released a string of LP's. In 1975, they released their first studio album (originally released in Australia only), titled 'High Voltage', followed by 'T.N.T' shortly thereafter. In 1976, they started to gain a little bit of international success, because of the release of 'High Voltage' and 'Dirty Deeds Done Dirt Cheep' in Europe and the U.S (actually, the U.S didn't see 'Dirty Deeds' in stores until 1981, but whatever). Finally, in 1977, they released their first international album, 'Let There Be Rock'. AC/DC enjoyed radio airply, high album sales, and high grossing tours, for quite some time. Unfortunately, shortly after the release of their 4th international album 'Highway To Hell', singer Bon Scott was found dead in the back of a friends car. He aperantly died because of a combination of Hypothermia, and choking on his own vomit (a popular trend among rock stars). Scott's friend, Ozzy Osbourne, wrote the often misinterpreted song, 'Suicide Solution' about the late singer. Later that year, AC/DC recruited a new singer, the infamous Brian Johnson. They released 'Back In Black' in late 1980. It is now the 5th highest grossing album of all time-selling 21,000,000 copies in the US alone. This was because of the ever popular singles 'Back In Black' and 'You Shook Me All Night Long'. AC/DC continues to release popular albums today, and retains a vast fanbase, even through all of the changes the music industry has endured.",
  "example": "Most fans of AC/DC now days had no clue that they were even from Australia, or that they even had another singer who died, because most AC/DC fans now are just poseurs.",
  "contributor": "REDWHITEnCrue25"
}
{
  "word": "Alison",
  "short_desc": "Alison A beautiful, hott, sexy girl. One who thinks she is not pretty but is the most gorgeous person ive ever seen. she will one day end up with all she ever dreamed of, because she didnt take advantage of what she had when she was younger.",
  "meaning": "Alison's are gods who don't realize how precious they are, and always underestimate themselves. They hide they're true beauty and talents for the one that they fall in love with, although shes always beautiful she tries to keep it to herself and reserve herself for the one. Shes had her trust broken before and won't bring her wonders out until she has full trust within you. Can be a real goddess in bed, (only to the people she feels that deserves to feel her magic). If you mess with her heart you will regret it forever. She has high standards and doesn't put up with fakes or lies, Alison sees right through them. She loves to have a good time. She treats everyones problems as if they were her own, if you come to her for advice shes tries everything she can to solve them. She loves to help everyone and cares for people even more than she cares for herself. She's a sweatheart who can be sensitive at times where she feels helpless. When Alison's at her best she is so incredibly fun and fearless. They're mysterious and have alot more on their minds than you think they do. She's the best friend you will ever have she puts everyone before herself and always understands everyones problems no matter how strange they can be. Take care of your Alison's because she a delicate flower full of undeniable beauty, love, care, passion and sympathy. Shes got your back even if it means making herself look like a fool she'll always be there for you.",
  "example": "\"Shes got the light of love and far from the average girl, who is she and where did she come from?\"\"Thats Alison and you'll have to get to know her & the answer will come to you.\"",
  "contributor": "MaxxxD"
}
{
  "word": "Ajit Pai",
  "short_desc": "Ajit Pai The clogs that form in drains in college dorms from excessive shower masturbation by the residents.",
  "meaning": "The clogs that form in drains in college dorms from excessive shower masturbation by the residents.",
  "example": "The janitor left a passive aggressive note on the wall asking people not to yank it in the showers because he was tired of cleaning up the Ajit Pai every week.",
  "contributor": "llahlahkje"
}
{
  "word": "Asian Parents",
  "short_desc": "Asian parents Asian parents are not your typical white or any other race parents.. Here are the diffrences that make us asian teenagers more depressed then other people(this concerns 90% of the asians that are living in Canada or U.S) 1)We DO NOT get allowance  2)We DO NOT get to stay up till past 10pm supposivly due to affecting our grades  3)The only thing that our parents make for dinner is RICE AND FISH, RICE AND FRIED CHICKEN, RICE SOUP FRIED FISH, RICE MONGO FISH.  4)If you get below a B then they take something you love or like to do away from you until you get back up in next semester  5)THEY HIT US, mom bitch slaps, Dad throws you against wall or gets the belt and whips you until you start crying.  6)They CONTROL your life.. Your personality, what you believe in, your appearance.. and if you refuse what they tell you to do, they will take your computer away and ruin MY FUCKIN GAMING CAREER CAS IM ONLY ALLOWED 6 HOURS A DAY AND they didnt let me go to Dallas Texas which was $400 for plane that i was able to pay for myself that cud of ended up with 7 grand and it was during the summer break FFS &gt;_&lt; ...... I wanted to be a pro gamer, or a garbage man, not a fuckin doctor!! im too lazy and dumb to be a doctor so stop telling me i have to be a godamn doctor.. I WISH I HAD WHITE PARENTS GODAMIT!!  7)You have basicaly have to do all the chores in the house..  word of advice, do not get ur driving license until you move out of your asian parents house, or it will be a &quot;Go to the supermarket and get ricebags license&quot;",
  "meaning": "(Usually, but not always) Strict, nosey, and controlling. They make you go to summer school if you get a B+ in an honors math class, even if you had the best grade out of all the Asians who took that class, and replace your grade all because 'if you get 4.0, you get sit on stage when graduate!'. To Asian parents, summer is not a 'break' as it is to other children in America, but 'a time to catch up'. Summer for Asian kids include SAT/ACT/PSAT prep (whether its doing books or taking classes), summer school, piles of math books, etc. while others are hanging out with friends and making s'mores. Asian Parents control their kids' lives because they want them to get into a good college, so that 1) They can brag to their asian friends about what college you go to <---MAIN REASON 2) You can be a doctor and make lots of money and 3) They can brag about how much money you make as a doctor\rAsian parents often put on a facade to others that they are nice, normal American parents. Then, when your friends leave (if they ever get the OK to come over), your parents start yelling at you, pressuring you to do math, and/or beating you for something you did that 'embarassed' them (i.e. having a messy room). They also severely disapprove of technology (computers, ipods, tvs). If you get an A- its CLEARLY your ipods fault, so its going to be taken away until you get above a 98. If you watch an hour of TV, they begin yelling at you to stop and give you a lecture about how TV is like crack.",
  "example": "Asian summer: 8am-1:30pm summer school, 1:30pm-3:00pm math, 3:00pm-6:00pm tennis, 6:00pm-10:30pm math, FMLAsian parents: \"I signed you up for PSAT class!\"\rMe:\"...fine...\"\rAsian parents:\"Ooo since good deal I signed you up for ACT class too!\"\rMe:\"...WHAT?!!!!!!!!!!!! But according to these pretests Ill either get a 35 or a 36!!!\"Me:\"....I got...a 92%...\"\rAsian mom:\"WHAT?! I told you no ipod! NO MORE IPOD till you get 98!!\"Me: -watching friends-\rAsian mom: YOU WATCH TV FOR SO LONG!!!! GO DO MATH!!!\rMe: But mom I've only been watching for an hour!!!\rAsian mom: TV like drug!!! Once start can neeveerrrr stop! Addicted then you grades go down!Asian mom: NO TV ON WEEKDAYS....AND 2 HOURS ON WEEKENDSAsian mom: Getting B like cutting your leg off!",
  "contributor": "Katp10"
}
{
  "word": "Alabama",
  "short_desc": "alabama A truly lovely state, by certain standards, where the unofficial motto is...  &quot;Alabama: At Least We&apos;re Not Mississippi!&quot;",
  "meaning": "Where you marry and fuck your sister.",
  "example": "Sweet home, incest country!In Alabama, you sit at your front porch in a trailer park with a shotgun married to your cousin and you impregnate your ugly ass sister.",
  "contributor": "biggahniggah"
}
{
  "word": "African American",
  "short_desc": "African American A black person of african descent who is now an american native.",
  "meaning": "A black person of african descent who is now an american native.",
  "example": "Black Americans who are now citizens or residents of the United States who have origins in any of the black populations of Africa. African American.",
  "contributor": "Act right"
}
{
  "word": "Addison",
  "short_desc": "Addison Addison is a beautiful girl with a killer smile and can make anyone&apos;s day. She has your back even when you don&apos;t have hers. She has every guys eyes on her but wants none of their attention. She always stays loyal to her friends and will always stick up for her closest friends no matter what the situation is. She&apos;s beautiful inside and out even if she doesn&apos;t think so. When she likes a guy she can pretend to hate them all she wants and they would never find out. She&apos;s such an amazing girl and any guy that dates her is lucky, and if they think other wise then they aren&apos;t good enough for her. So yeah if you find a girl like Addison, keep her around because she&apos;s a real treasure!!",
  "meaning": "Addison is a beautiful girl with a killer smile and can make anyone's day. She has your back even when you don't have hers. She has every guys eyes on her but wants none of their attention. She always stays loyal to her friends and will always stick up for her closest friends no matter what the situation is. She's beautiful inside and out even if she doesn't think so. When she likes a guy she can pretend to hate them all she wants and they would never find out. She's such an amazing girl and any guy that dates her is lucky, and if they think other wise then they aren't good enough for her. So yeah if you find a girl like Addison, keep her around because she's a real treasure!!",
  "example": "The new girl is such an Addison!!",
  "contributor": "Pinklover776"
}
{
  "word": "Aimee",
  "short_desc": "Aimee Aimee is beautiful and kind. Loved by many. Also hated by many. she gets plenty of attention from the boys. She prefers to stay with someone for a long time. she doesnt fall in love easily but when she does it lasts and she really loves them. Alot of the girls are jealous of the boys she gets or loves, because they all really like the boy. But the boy is head over heels with her and only wants her  Aimee is a bubbily and funny person. She can be very ditzy though alot of the time. and she day dreams all the time! She isnt close to many people but she is a true friend. A bit of a bitch at times but she is super sexy and intelligent but she is extremelly clumsy!!",
  "meaning": "A compelling girl, who loves to be around people, she is intelligent and nice. Aimee will befriend anyone and everyone, she will always stick by you and will smile even in the darkest times. The best friend to have is an Aimee.",
  "example": "Person 1: wow that's a great friend you have!\rPerson 2: yeah, she is called Aimee",
  "contributor": "eXD"
}
{
  "word": "Adolf Hitler",
  "short_desc": "Adolf Hitler Leader of the Nazi party and the Third Reich.",
  "meaning": "Leader of the Nazi party and the Third Reich.",
  "example": "Watch the award winning film 'Der Untergang' aka 'Downfall', to see Bruno Ganz's very convincing portrayal of Hitler.",
  "contributor": "Ookpick GooseFrubba"
}
{
  "word": "ann coulter",
  "short_desc": "Ann Coulter 1. Someone I would pay a lot of money to see Mr T donkey punch. 2. The crziest bitch on the planet",
  "meaning": "The person that Satan looks to for inspiration.",
  "example": "On The Today Show, Ann Coulter blamed migranes, the destruction of Pompeii, and the extinction of the wooly mammoth on liberals.",
  "contributor": "Ann Cou|ter"
}
{
  "word": "alcohol",
  "short_desc": "alcohol The cause of, and solution to all life&apos;s problems.",
  "meaning": "The cause of, and solution to all life's problems.",
  "example": "To ALCOHOL: The cause of, and solution to all life's problems.",
  "contributor": "Matt J"
}
{
  "word": "Ashlee Simpson",
  "short_desc": "Ashlee Simpson From a recent interview in &quot;Lucky&quot; magazine:  &quot;I&apos;m totally against it and offended by it,&quot; Simpson told Lucky magazine. &quot;I&apos;m going out to let my real talent show, not to just stand there and dance around. Personally, I&apos;d never lip-synch. It&apos;s just not me.&quot;  Can we quote you on that, Ashlee?  What&apos;s next, an &quot;accidentally leaked&quot; Internet sex tape?",
  "meaning": "From a recent interview in \"Lucky\" magazine:\r\r\"I'm totally against it and offended by it,\" Simpson told Lucky magazine. \"I'm going out to let my real talent show, not to just stand there and dance around. Personally, I'd never lip-synch. It's just not me.\"\r\rCan we quote you on that, Ashlee?\r\rWhat's next, an \"accidentally leaked\" Internet sex tape?",
  "example": "Ashlee (and Jessica) went to the Milli Vanilli School of Music Performance.",
  "contributor": "A friend of a friend...who knows about Jessica"
}
{
  "word": "American Eagle",
  "short_desc": "American Eagle a clothing store for teenagers with a generally &quot;preppy&quot; style. it doesnt say anything about your personality if you shop there. and you should not be labeled a bitch just because you like an ae shirt. half the people leaving ae definitions have most likely never worn ae let alone gone into one of their stores. my god!",
  "meaning": "1. A bird\r2. A clothing store found in most malls around the country\r",
  "example": "1. Whoa look at that american eagle feeding its young.\r2. Whoa those jeans you got at American Eagle are so cute.",
  "contributor": "Jeffrop6691"
}
{
  "word": "April",
  "short_desc": "April A left-leaning, cultured, intelligent, down-to-earth chic that has tons of friends throughout the world.  She&apos;s a lover of cinema and ethnic cuisines, has a witty sense of humor and is a great person to get advice from.  She&apos;s the friend that is always there if you need her.  She&apos;s also fantastic in the sack. ",
  "meaning": "beautiful girl inside and out, very attractive, HOT, shy at first, sometimes hard to get to know, great sense of humor, loves the finer things in life, has many many talents, amazing friend and girlfriend, master at everything she attempts, very creative, will rise above obstacles placed in her way, she is a find a way make a way kind of girl, she will surround herself with beautiful things. She is a keeper if you treat her well she will give you her heart and if she gives you her heart you will not regret it. She is very loyal, she will never lie to you, is basically the perfect girlfriend but no one knows it. She will never let you regret anything and will always be there for you.",
  "example": "Wow she's definitely an April.",
  "contributor": "Gurrrl"
}
{
  "word": "Aurora",
  "short_desc": "Aurora The most bad ass girl on the planet. She makes Chuck Norris whimper. Not only is she great and powerful but her beauty can not be described. Named after the northern lights, she rains sunshine on everyone&apos;s day.",
  "meaning": "Aurora is not a very common girl to find but if you find one, she's most commonly agreed by people as The most amazing girl you can have she could light up a guy's world like nobody else and will make them cry tears of joy. She's definitely the loving type and will accept all the love a guy isn't willing to put for her, she's definitely a tough cookie but also sweet, she's the smart type too and excels in a handful of activities and is know now to overwhelm others, she's commonly known as beautiful and gorgeous and may have some insecurities and tough barriers and may be argumentative but if a guy worthy enough can handle that and love her for who she is then they'd have the best relationship ever everyone needs an Aurora in their life it can definitely be a unique an amazing experience.",
  "example": "I'm glad I got my Aurora, She's the one!",
  "contributor": "The_Wise_Ant"
}
{
  "word": "awkward",
  "short_desc": "awkward passing a homeless person on your way to a [coin star] machine.",
  "meaning": "When something weird or embarrassing happens, and there's that silence after it. No one really knows what to say, or choose not to say anything. Just back slowly away..",
  "example": "When you're making out with someone and then you realize your zipper is down. You zip it up slowly...But he notices *awkward*When you walk in on your parents doing \"family planning\"",
  "contributor": "donottouchthat"
}
{
  "word": "Ayden",
  "short_desc": "Ayden Amazing personality, doesn&apos;t take shit from anyone, knows what he wants in life, handsome &amp; charming, mommys boy but looks up to his daddy",
  "meaning": "Ayden is the sweetest guy you will ever meet.He is committed to who/what he loves\rIf he loves you he will always let you know\rHe will always be there for you\rHe may be quiet and shy but once u get to know him he can be annoying",
  "example": "Omg,Aydens so sweet!",
  "contributor": "Masterguy46782"
}
{
  "word": "Ashlyn",
  "short_desc": "Ashlyn An awesome gal with an awesome attitude. very talented in what they do, and are usually [twinkie&apos;s] They are very creative and usually musical. They like to eat. Be friends with them.",
  "meaning": "Ashlyn is a very kind girl. But don't make her mad or you will regret it. Ashlyns hide there feelings in front of people and ah they don't care but they actually are in pain. Ashlyn is very beautiful but she doesn't think that. She is one of the most caring people you can find. Ashlyn cares to much about other people that she forgets about herself and gets hurt. But in the end she has a very kind heart, if you have an Ashlyn don't let her go.",
  "example": "Person 1~ did you see Ashlyn today\rPerson 2~ yeah she is very beautiful!!",
  "contributor": "ᒪOᐯE Yᗩᗩ"
}
{
  "word": "Abi",
  "short_desc": "Abi She is a [star]  don&apos;t let her go.",
  "meaning": "She can be funny, crazy, and weird. Although she can be slow at times, she is intelligent. Abi's the kind of person people fall in love with. She's also confident, loving, amazing, caring, and outstanding. As her friends sometimes say she's lazy, they aren't lying. As her sense of style is fabulous, it can be sometimes simple. Although she may have been through alot, you can never tell behind her beautiful smile.~ Don't you wish you had a Abi 💋💄💎👑✨🔥",
  "example": "As Abi and her friend walked through the hall, they laughed like monkeys.",
  "contributor": "Brii Hendersonh"
}
{
  "word": "Alana",
  "short_desc": "alana the most amazing person in the world, somtimes on back order, every body loves her and wishes to be her friend. No guy can resist!",
  "meaning": "Alana is amazing. She’s hilarious and has awesome comebacks. You can talk to her for hours and never be bored. Alana is smart and could write you a thesis in five minutes. She’s also beautiful but doesn’t know it and has the confidence to not care what other people think of her. She’s caring and relatable. If you find someone like her, never let them go.",
  "example": "Did you see Alana when she put her hair down? She’s so pretty and amazing. I heard she doesn’t even know it.",
  "contributor": "Prestidigitatious"
}
{
  "word": "Alan",
  "short_desc": "alan 2. Alan  cool, charming, suave, awesome with the women.  a real tough guy.  the second definition of alan.",
  "meaning": "(Verb) To pull an Alan, or to Alan someone: to sever emotional ties and cut off all forms of communication to one or more persons in a sudden act of selfishness.",
  "example": "Did you hear what happened to Linda?\r-No, what happened?\rHer son pulled an Alan on her, and cut her out of his life. She's been a complete wreck lately.",
  "contributor": "Alanisajerk 0617"
}
{
  "word": "Agnostic",
  "short_desc": "agnostic An agnostic is a person who believes that the existence of a greater power, such as a god, cannot be proven or disproved; therefore an agnostic wallows in the complexity of the existence of higher beings.   Agnostics on religion (Christianity, Islam, Buddhists, etc): Religious zealots are often viewed as ignorant by agnostics’ because of their blind following of a supreme being which may or may not exist. Agnostics will often question the existence of a supreme power because a lot of modern religious beliefs have no basis in modern logic; therefore blind following of popular religions is viewed as an easy out for people who chose not to think for themselves.   Agnostics on atheism: On the other end of the spectrum, unlike atheists, an agnostic uses a more scientific approach to their belief system. An agnostic knows that just because there is no physical proof of the existence of a higher being, it dose not automatically mean that one does not exist. An agnostic views an atheist on the same plane as a religious zealot; often because the belief that human beings are the pinnacle of intelligence and there are few things that we do not or have the potential to understand.  The realization of knowing that “we cannot know everything” is the backbone of the agnostic belief.",
  "meaning": "A person who is sensible enough to admit that they have no fucking clue what is going on in the universe.Contrary to both a Theist (someone who sits in Church thinking they have shit figured out) and an Atheist (someone who sits at Starbucks thinking they have shit figured out).",
  "example": "Theist: \"God exists.\" *prays*\rAtheist: \"God does not exist.\" *sips grande cappuccino*\rAgnostic: \"We can't know.\" *continues living*",
  "contributor": "Cadaei"
}
{
  "word": "Ash",
  "short_desc": "Ash That gay ass prick from pokemon.",
  "meaning": "the purest, sweetest, kindest human you'll ever meet. they're perfect in every single way, and absolutely stunningly beautiful. They can make your heart flutter in one giggle. Also, their hand fits perfectly in yours and thier lips against yours are meant to be.",
  "example": "Im dating ash; I could die happyAsh is the best date mate you'll ever meet in your entire life",
  "contributor": "Heyoits_Me"
}
{
  "word": "abbie",
  "short_desc": "Abbie Abbie is hott. she is a skinny nice girl who get what she wants! all the guys want Abbie. people are mean to her because thay want to be her. abbie is attracted to tall guys that play basketball and can play an instrument. most of the time this guy is a family friend. abbie has a strong faith for god and doesnt care what people think. Some people think abbie is a overacheiver . abbie is not afraid to be herself and always fits in abbie can be bubbly at times but people deal with it cuz she is so gorgeouse we all love abbie &lt;3",
  "meaning": "abbie is the best friend anyone could ask for, especially once you get to know her. She has such an amazing personality and all the boys are after her because she is outstandingly beautiful! Along with looking like a model, shes absolutely hilarious and very very lovable!! It is close to impossible that you will ever find someone as amazing as her",
  "example": "I love abbie!",
  "contributor": "mahhehhehheh"
}
{
  "word": "Abbey",
  "short_desc": "abbey dynamite because all abbey&apos;s are the bomb. ",
  "meaning": "Abbey: the girl that all girls strive to be. The girl that all guys strive to get. She's exquisitely beautiful. But she has a hard time making herself believe it sometimes. She's as humble a person as you'll ever meet. She's all you will ever need. Show her love and she will trust you. Show her respect and correct affection and she will love you. Once you have an abbey don't ever lose her. She's a dream girl. Where she smiles, there are no more troubles. Where she laughs, all worries disappear. Where she cries, is on your shoulder. And where she loves, nothing else is needed. So listen up punks. Treat this woman like she deserves. Never let a moment pass without making sure she knows you care. Take care of her. And she will take care of youshe needs you and you sure as hell need her.",
  "example": "Abbey, the girl so beautiful it makes you afraid to approach.",
  "contributor": "Lover💛Boy"
}
{
  "word": "Army",
  "short_desc": "Army A.R.M.Y (아미) which stands for Adorable Representative M.C for Youth. They are known as the fans of the famous south korean boy group, BTS.",
  "meaning": "A.R.M.Y (아미) which stands for Adorable Representative M.C for Youth. They are known as the fans of the famous south korean boy group, BTS.",
  "example": "hey are you an ARMY? yes i am bitch, hobi is my sunshine",
  "contributor": "hobismysunshine"
}
{
  "word": "Ashanti",
  "short_desc": "Ashanti Ashanti is the name for a beautiful girl. She sometimes has trust issues from the past mistakes. Ashanti is kind hearted and friendly and once you mean an Ashanti you never want to loose her! She&apos;s awesome. Although, she falls in love pretty quick but knows that she loves the person! She&apos;s usually from Africa or Jamaica. The personality of an Ashanti is unpredictable because she will love you as long as your nice to her... Ashanti is usually healthy and fit with lots of curves. She is usually rude and aggressive and if she doesn&apos;t like you, you&apos;ll know about it.  She&apos;s an amazing friend and a loving partner and you never want to lose someone like Ashanti! She&apos;s one of the best people you&apos;ll ever meet.",
  "meaning": "Ashanti is the name for a beautiful girl. She sometimes has trust issues from the past mistakes. Ashanti is kind hearted and friendly and once you mean an Ashanti you never want to loose her! She's awesome. Although, she falls in love pretty quick but knows that she loves the person! She's usually from Africa or Jamaica. The personality of an Ashanti is unpredictable because she will love you as long as your nice to her... Ashanti is usually healthy and fit with lots of curves. She is usually rude and aggressive and if she doesn't like you, you'll know about it.She's an amazing friend and a loving partner and you never want to lose someone like Ashanti! She's one of the best people you'll ever meet.",
  "example": "Man 1: Look at that stunning girl over there.\rMan 2: Her names Ashanti and she's really nice and friendly\rMan 1: I should've known by her name.",
  "contributor": "awesome eastenders"
}
{
  "word": "Anonymous",
  "short_desc": "Anonymous Formerly known as the &quot;final boss of the Internet&quot;, Anon has become simply a bunch of weeaboo faggots who wish to be a part of something.",
  "meaning": "Anonymous is the ultimate internet tough guy. An OL psycho bully, butthurt about being everybody's bitch and being pwnd IRL all the time, set himself to win the only way he kind of knew how, which is also ironical since it was his's smart odds that usually got him raep to begin with. Being the IRL pussy that he is, decided to hide his actions' persona behind true anonymity; in an undifferentiated gang of other sorry ass losers. Those actions more often that not, resulted in major lols, as expected of such fail IRL lolcows. Finally getting tired of being the laughing stock of the universe in all imaginable possible ways, they decided to better justified it and say that it was on purpose and hence forged a new inducive adage, that they 'did it for the lulz', or if with a sugarcoated moralfag anarchy twist, 'for great justice'. Which is either way pointess and contradictory self-pwning anyhow. They're also closet attention whores that get their kicks of unwarranted self-importance by vandalizing real attention whores' shit and people who disagree with them; since most people are not major geeks, just could not emotionally get it, and are hence labeled anti-lulz; the real attention whores were of course asking for it and deserve to get rape accordingly. Almost needless to say, intellectually that senseless shit of a ideological manifesto is just like them, laughable. What a great achievement to moronically troll a 16 year   old girl facemyliveshit account, must've been a real tough cookie to crack; you are so hXc. Nigga please, it that's the best You can do, then pleeeaaase DO NOT WANT U to lolfight any more 'baetlz k'. It's not even funnay anymore, not that it ever was. Anon's nowadays synonymous with a lame OL prankster. It is common knowledge that there's no oldanon, it just remains constant the same plain old shitty level of anon crap; the real oldanon left the scene when they weren't any more real challenges or grew up. It is useless to increase the quantity of them by dynamically recruiting fucktards, since they are all unreliable retarded rap-loving 13 year old boys newfag emo furry shit. Since anon is supposed to be behaving the way that everybody really wants; well, then become an heroes; that's what we all really want (or at least is what I want). What a bunch of wimpy shitheads. Laugh at anons every chance you get; laugh at the size of their e-penis; laugh at their lolfighting for shit no-one cares about; laugh at their inability to command respect OL. Since anon nevar4gets; yeah right; to get a life perhaps, since every waking moment is a tormented hellish sempiternal remainder of his IRL fail. But wait, wouldn't that also make You kind of an anon; what a mindfuck! Anons sure is serious business... Fo sho rly!\r",
  "example": "Anonymous would like everybody to get a twisted sense of humor; troll the interwebz, protest scientology, watch Faux News, blow up vans, become an heros; buy a dog, curtains, goggles, mudkips, Guy Fawkes masks, etc; just for graet justice!\r\rDubious Disclaimer: This definition was written for the lulz!\r",
  "contributor": "mayor_lulzer"
}
{
  "word": "Angelica",
  "short_desc": "angelica The most beautiful girl ever. She is untouchable, and any guy she gets with better know how lucky they are. This girl has guys waitin in line one by one, and bitches keep hatin! This girl wont take your shit! She is one of a kind aint no one else like her! ",
  "meaning": "Angelica is gorgeous, sweet, and very helpful. If you are having trouble with friends angelica is right there for you. She is well known for being loved by everyone, and treats friends with love and respect! She is caring and will never leave you. She would always tell you the truth, and she would do anything to protect her friends. Girls wanna be her, and guys wish they were with her. She is NOT a backstabber unless you do something extremely disastrous. She is so sweet and no one hates her cause they can't. Angelica is the best person on earth. She has soft smooth skin, and luscious long dark hair the color of the night.",
  "example": "\"Omg did you see angelica today?\"\"Yeah she looks like a model!!\"\r\"And she's soooo sweet!!\"",
  "contributor": "bella2435"
}
{
  "word": "Ashton",
  "short_desc": "Ashton The most sexiest, awesome person alive. The best friend you could ever ask for",
  "meaning": "Ashton is funny and hilarious and when u r not smiling literally Ashton will start to make u smile no matter what mood ur in he is a great friend and I hope that if ur friends with a Ashton u should keep him for a friend forever Bc no matter what he will find away to make u happy and smile",
  "example": "Ashton is a hilarious friend",
  "contributor": "Kadence_1448"
}
{
  "word": "Audrey",
  "short_desc": "Audrey An incredibly blessed child of God. Audrey is both noble and full of strength.",
  "meaning": "Lovely Audrey has a special personality that sets her apart from others and draws others to her side. Audrey means noble strength. Audrey is a determined young lady whose head and heart will lead her steadily toward her goals. Audrey will bring much joy to her family",
  "example": "Audrey: hi",
  "contributor": "I’mtired1234"
}
{
  "word": "algebra",
  "short_desc": "algebra 1. an exotic form of torture.  see also [geometry]. 2. the art of figuring what &quot;y&quot; equals when &quot;x&quot; equals 10 through confusing formulas such ast y=12x^2-563x+1/4 3. a method of making high school math teachers feel important.",
  "meaning": "also known as mindfuck",
  "example": "kid:mom I had algebra today\rmom: WTF, WATCH YOUR LANGUAGE SON!",
  "contributor": "beany16"
}
{
  "word": "and I oop",
  "short_desc": "and i oop- When something or someone does something that catches you off guard or catches your attention. Can be a response to a very bold statement or action or also when somone is so good looking that you are taken back by their looks. Comes from a popular meme video where someone says it and makes a suprised face.",
  "meaning": "I just hit my balls",
  "example": "Nobody:Jasmine Masters: And I oop-",
  "contributor": "Michael Jackson's big toe"
}
{
  "word": "asl",
  "short_desc": "asl What stupid people say on chats to learn who you are and where you live so they can come to your house with a chainsaw and kill you.",
  "meaning": "age sex location. used by the 10,000 horny teenage boys on omegle to find the 50 horny teenage girls on omegle.",
  "example": "You're now chatting with a random stranger. Say hi!Stranger: asl?\rYou: 17 m usa\rStranger: 18 m usa\rYou: we need to stop fapping.Your conversational partner has disconnected.",
  "contributor": "bassmasta24601"
}
{
  "word": "Ariel",
  "short_desc": "ariel a crazy and adventurous person, whose infectious laugh sucks others into her silliness",
  "meaning": "A beautiful young lady who is very caring and loving but hides her feelings , she's very smart and the room lights up everytime she walks in . She keep smiles on people face and is not that loud but when you tick her off she's more like a siren people love ariel's there beautiful , talented , and very smart .",
  "example": "I love me an ariel.",
  "contributor": "OG.💸"
}
{
  "word": "Aj",
  "short_desc": "Aj Aj is a guy every girl wants. He is caring, lovable, humorous, and Musically talented. He has breathtaking eyes and a beautiful smile. He is a gentleman and interacts with people easily. He is a loyal friend. You can come to him with anything; he wont judge you. He is worth waiting for. Don&apos;t lose him.",
  "meaning": "Aj is a guy who will always be there for you. He is loyal and the best boyfriend and is super amazing. He is a guy you couldn't live with out. Aj is cute, amazing, sweet, kind, aweome, and over all the best guy you could ever meet. You couldn't live without this Aj. He will always be there for you and is completley aweome. This is a guy u would take a bullet for any day.",
  "example": "Girl: When did u become so awesome.Guy: I'm pulling an Aj.",
  "contributor": "The awesome person09(:"
}
{
  "word": "Alec",
  "short_desc": "alec the coolest person in the world. smart, funny, sexy,, just completely amazing. Most girls want him in the sack and just cant resist being around him.",
  "meaning": "He is characterized by one of the most real people you will know. He may hide who he truly is at first, and may pass as an asshole or someone who will pass you over, or one may be scared to talk to him because he is weird, BUT if you take the time to understand, he is one of the sweetest people you know. He is the most caring and loves the people he cares about with all he has. He is understanding and when it comes to effort for someone he loves, he won't put a little effort, but all he has into making you happy. He may think he is a self-centered asshole, but even he doesn't know himself. He doesn't realize he is the best person anyone can be. Your life will immediately be better when he steps in it. He gives the warmest hugs and has the best smile that will warm your heart. He is fun to hang out with and will make you laugh at some dumb stuff he either does/says. He puts aside judgement and has no hatred for anyone unless they have done a great deed of wrong toward him. He is human and may have made some mistakes in the past, but he knows how a human should be treated. He has so much to offer. He is all around one of the best people you will know, and life itself would be dull without him.",
  "example": "Friend: Where's Alec?\rPerson: I don't know, but I love that dude",
  "contributor": "habituallydeadinside"
}
{
  "word": "Atheism",
  "short_desc": "atheism Atheism is simply the opposite of theism. The prefix A means &quot;without&quot; or &quot;not&quot;, so Atheism is simply a lack of belief in god(s). It is not a religion, just like theism is not a religion. Atheists are usually quite fond of life, since it is the only one we have.Theists if you think about it, need a god to make their existance make sense and to make them respect life.",
  "meaning": "The lack of belief in a deity or deities. Just that. Nothing else.Atheism doesn't hold any answers to life's big questions. It won't tell you the meaning of life and it won't tell you how it all started. It's not a religion, not a philosophy, not a way of life. Atheism is quite simply *non-belief*.",
  "example": "#1: \"I heard you're an atheist and don't believe in God, #2. If that's true then how did the universe begin?\"\r#2: \"I don't know for sure. The leading scientific theory right now is the Big Bang theory, but that has a few problems and might not be correct.\"\r#1: \"If there's no God then where do we know right from wrong from?\"\r#2: \"Again, I don't know for sure, but the general theory is that we evolved this feature because social creatures do better if unit cohesion isn't hindered by constant murdering.\"Atheism isn't about answers. It's not really about anything, actually.",
  "contributor": "mrbogart"
}
{
  "word": "Allie",
  "short_desc": "Allie (a) A name usually given to females and is derived from the male names &quot;Alexander, Alessandro&quot;  (b) Short for &quot;Allison, Alexandra, Alexandria, or Alessandra.&quot;   (c) People with this name are usually goodlooking/attractive, smart, funny, and very nice.   (d) It literally means &quot;protector of mankind&quot;",
  "meaning": "Girl who are named Allie:\r- Sweet and Nice.\r- Amazing smile.\r- A is for awesome. L is for Loveable, L is for Lucky guy that gets her, I is for I wish i was her, E is for everyone loves her!!!!!\r- Usually skinny. Not fat.\r- Most Allie's are very gorgeous but dosen't know it.- Usually brunette sometimes blonde.\r- Are normally very very good at sports.\r- Have lots of friends.\r- Super cute.",
  "example": "\"Allie is super cute, always smiling and making you laugh. Everyone needs an Allie in their life!\"",
  "contributor": "Jacksnack"
}
{
  "word": "ABC",
  "short_desc": "ABC American Born Chinese",
  "meaning": "American Born Chinese",
  "example": "Man, he ain't azn, he's ABC.",
  "contributor": "Bubba"
}
{
  "word": "amazing",
  "short_desc": "amazing Something that is so wonderful, it is hard to find the words to match.  Something that makes your heart beat faster or your heart melt. Something that tops everything else, and always crosses your mind.",
  "meaning": "Something that is so wonderful, it is hard to find the words to match.  Something that makes your heart beat faster or your heart melt. Something that tops everything else, and always crosses your mind.",
  "example": "Everything Alex is and does is amazing to me.",
  "contributor": "Renee"
}
{
  "word": "Alexander",
  "short_desc": "Alexander Usually a very very very goodlooking straight gentleman that has great taste in women. He has a crazy side to him but only shows it infront of true friends. Has great style, is hilarious, amazing, caring, sweet and will make you smile. You will always have a good time with an Alexander, so if you got a friend named Alexander count yourself one of the luckiest people in the world!",
  "meaning": "Usually a very very very goodlooking straight gentleman that has great taste in women. He has a crazy side to him but only shows it infront of true friends. Has great style, is hilarious, amazing, caring, sweet and will make you smile. You will always have a good time with an Alexander, so if you got a friend named Alexander count yourself one of the luckiest people in the world!",
  "example": "Why you smiling like that?\rI hung out with Alexander\rNO WAY!",
  "contributor": "asdi ghjkl"
}
{
  "word": "adriana",
  "short_desc": "adriana adriana a drop dead gorgeous girl that is very independent. she&apos;s unique and down for shit. she can be the sweetest girl you know or the biggest bitch in your life. once you meet her your life will be 100 times better. she has a body of a hourglass and and a face of an angel. she has a little waist and a big round cake. she&apos;s a stunner, once she walks in the room it&apos;s all eyes on her. She may come off as being complicated but in the end it&apos;s all worth it.she could give two fucks about people who talk shit she&apos;s too good for that. don&apos;t test her patience because she will kick your ass. she&apos;s someone you can vent to and someone with good advice. you will meet someone like her in your life. she&apos;s truly genuine. she has the most amazing eyes and voice. she&apos;s multitalented and she strives for the best. most loyal and faithful piece of ass you will have in your life. she is a dime plus 99 you won&apos;t get enough of this girl. she tends to be confident and is ruthless. basically adriana is the most amazing person you&apos;ll ever meet!",
  "meaning": "adriana a drop dead gorgeous girl that is very independent. she's unique and down for shit. she can be the sweetest girl you know or the biggest bitch in your life. once you meet her your life will be 100 times better. she has a body of a hourglass and and a face of an angel. she has a little waist and a big round cake. she's a stunner, once she walks in the room it's all eyes on her. She may come off as being complicated but in the end it's all worth it.she could give two fucks about people who talk shit she's too good for that. don't test her patience because she will kick your ass. she's someone you can vent to and someone with good advice. you will meet someone like her in your life. she's truly genuine. she has the most amazing eyes and voice. she's multitalented and she strives for the best. most loyal and faithful piece of ass you will have in your life. she is a dime plus 99 you won't get enough of this girl. she tends to be confident and is ruthless. basically adriana is the most amazing person you'll ever meet!",
  "example": "I know adriana",
  "contributor": "forever_adri"
}
{
  "word": "Asswipe",
  "short_desc": "asswipe 1) a device that has been used to remove excrement from the anus. 2) a person who resembles in behavior, language or attitude a device used to remove excrement. ",
  "meaning": "There is a common misconception that an asswipe can be equated to an asshole. This is quite untrue. An asswipe simply doesn't care. This is usually carried out to such an extreme extent that the apathy brings misfortune to those around the asswipe.The key distinction is intent. An asshole would stick his leg out to trip you, making you drop what you were carrying and bringing general harm upon you. An asswipe would never dream of tripping you, but if you did trip, he would simply watch as you struggled to collect the scattered papers you had dropped. He doesn't hurt you but would never think of lifting a finger to help. He also may laugh a little at the sight of you falling over.",
  "example": "Victim: \"dude, you pushed me into quicksand, you asshole.\"\rAsshole: \"haha, I did.\"Victim: \"dude, I fell into quicksand, help me!\"\rAsswipe: \"eh.\"",
  "contributor": "Timmers1112"
}
{
  "word": "American Football",
  "short_desc": "American Football American football and rugby are both physically demanding sports... I&apos;ve played both... The styles of play are much different though... Rugby is about pure tackling and ball movement as opposed to football which is about impact in addition to tackling skill and quick linear movement down field. The speed and impact in American football is the reason for the pads (without them, the amount of spinal cord and brain injuries would be horriffic)... With regard to the breaks between plays in football, there&apos;s a purpose other than giving the big guys on the lines a break (and by big, I mean 300+ pounds...). American football is a game of set plays and tends to get very complex with all the terminology and the amount of plays you have to memorize (most coaches script anywhere from 150 to 250 possible plays per game). Granted, rugby is more fast paced and the plays are more oriented to the flow of the game which makes it pretty exciting to watch and challenging to play. As far as I&apos;m concerned, they&apos;re both great sports with their own challenges.",
  "meaning": "An excellent indie rock/emo band from the 1990s, fronted by Mike Kinsella (of Owen).",
  "example": "Stephen: \"My favorite emo band? Definitely I Hate Myself.\"Bob Nastanovich: \"No way, dude. American Football takes the cake.\"",
  "contributor": "entrancetheory"
}
{
  "word": "Anarchy",
  "short_desc": "Anarchy Mostly seen now adays when posers write it on there bags or hands. They never have any idea what it means, and probably have no interest in politics whatsoever.",
  "meaning": "\"Anarchy\" arises from ancient Greek \"An,\" meaning without and \"Archos\" meaning leader.\rIn modern political philosophy anarchy, or anarchism (the ideology which aims to create anarchy) is traced back, often, to Proudhon, and in particular his work \"What is property?\" - the origin of the still used anarchist slogan \"Property is theft!\"\rContrary to belief that \"anarchy\" is synomous with \"Disorder,\" anarchists generally advocate non-hierarchical, horizontal organization, typically through directly democratic structures. As such, there is a degree of common ground between anarchists and libertarian Marxists. Many anarchists are highly supportive of the practice of the Zapatistas in Chiapas.",
  "example": "In 1936, anarchists in the Spanish provinces of Catalonia and Aragon collectivised industry and agriculture, and established a working example of anarchy.",
  "contributor": "www.revleft.com"
}
{
  "word": "A",
  "short_desc": "a Favorite interjection of The Fonz.",
  "meaning": "It's literally the letter A. Why did you look this up?",
  "example": "\"Wow, I really don't understand why you looked up THE FREAKING LETTER A\"",
  "contributor": "xxTrashyMilkCartonxx"
}
{
  "word": "Anal",
  "short_desc": "anal What to avoid in prison.",
  "meaning": "A beautiful word that can be described in various ways:Dick hole in the butt hole\rSausage in the bun\rPee-pee in the poo-poo\rCharlie in the chocolate factory",
  "example": "+Hey babe, what's up-Nothing interesting, but my ass is horny, you wanna do anal?+Oh yes the old pee-pee in the poo-poo-YEESSS",
  "contributor": "kataplaka"
}
{
  "word": "Antonio",
  "short_desc": "Antonio Antonio can be Mexican, Italian, or a Black person&apos;s name. It originated in Italy, many people mistake it for a Mexican person&apos;s name.   Usually people with the name Antonio are amazing lovers. They usually are very good looking and could take your breath away with just one glance.",
  "meaning": "If you are found by an Antonio, consider yourself lucky.He will amaze you with his charm, sense of humor, and thoughtfulness - and impact you in ways you never thought someone could.10/10 cuddler, but sometimes you just wish you could hold him closer, even if it's physically impossible. He comes with extra perks such as luxurious sherpas and world class culinary skills. Drinks ridiculously copious amounts of coffee and mio, but it's the cutest thing ever.No matter how much time you spend with him, you'll never get tired of him because he's the coolest guy you'll ever meet. You'll miss him the instant you're not with him, but this busy boii will keep you happy with his glorious snaps.An Antonio is so smart that it'll knock your socks off, heck maybe even the rest of your clothes just from his sexiness.Antonio is a one and only treasure. He doesn't stick around for long but the moments you get to spend with him are bliss, especially when he tells you about his life, his interests, and his passions. His guitar playing is the best and you'll never get enough of it. Heck, you'll never get enough of him. But you'll just tell yourself you were lucky to have gotten any of him.",
  "example": "I tink if Antonio were to chill any more he could reverse global warming just with his coolness",
  "contributor": "edgarshmedgar"
}
{
  "word": "Adorkable",
  "short_desc": "adorkable Both [dorky] and [adorable]. A higher state of being all [dorks] strive towards.",
  "meaning": "A person who is both a dork and adorable at the same time",
  "example": "Cj from Fizzi's server is quite adorkable",
  "contributor": "Oblivioncorp"
}
{
  "word": "asian",
  "short_desc": "asian the race with the hottest girls. ",
  "meaning": "(Attempting to add a decent, more serious and accurate definition to the lot.)\r\rIn the United States, the most common use of the word refers to people originating from East and Southeast Asia (China, Japan, South/North Korea, Vietnam, among others). Indians and Pakistanis might be referred to as South Asians, where as Filipinos and Samoans might be called Pacific Islanders.\r\rIn England, \"asian\" most commonly refers to people of Indian or Pakistani descent, whereas \"oriental\" might refer to East and Southeast Asians (NOTE: \"oriental\" is certainly considered politically incorrect in the United States).",
  "example": "U.S\r- I know she's Asian, but where is her family from?\r- I think they emigrated here from Vietnam some years ago.\r\rEngland\rThe Asian students presented a traditional Indian dance to their classmates.",
  "contributor": "amg"
}
{
  "word": "AK-47",
  "short_desc": "AK-47 Avtomat Kalashnikov 1947  Invented by Mikhail Kalashnikov.  Quite possibly the most popular assault rifle in existence, mostly because of mass proliferation.  7.62x39mm Soviet, 30-round clip.  Has countless variants.  Today it is black-marketted by terrorist cells (mostly because the AK is easy to make). The AK-47 has been reported to have certain performances that surpass that of the Colt M16 series, and one reason is because the AK doesn&apos;t contain as many moving parts (therefore, maintenance is very easy).  The AK-47 can also brave any type of harsh condition and environment.  There are ALL kinds of variants to the AK-47: *AK-74 (5.45x39mm Soviet assault rifle) *AKS-74u (5.45x39mm Soviet carbine) *Saiga 12 (12g auto shotgun) *Dragunov SVD (7.62x39mm Soviet sniper/infantry-backup rifle) These 4 are just some.",
  "meaning": "The Avtomat Kalashnikova model of 1947 is a gas operated, selective fire assault rifle designed from 1945 to 1946 by Soviet tank commander Mikhail Kalashnikov to fill the need for a rifle-caliber automatic infantry weapon within the Soviet military, after experiences against the German StG-44 which deeply influenced Soviet doctrine in the post-war years. It has become the single most prolific weapon ever created, with models in use by military and police, or civilian consumers in nearly every country in the world. Chambered in the intermediate 7.62x39mm R.The AK-47 is best described as an amalgamation of several previous weapons designs. It has the Trigger, Double locking lugs, and unlocking raceway of the M1 Garand and M1 Carbine, the Safety mechanism of the John Browning designed Remington Model 8, and the layout and gas system of the StG-44.Versions of the AK-47 include the following:AK-47 Type 1/2(1948-1951) - Most rifles manufactured with a milled steel receiver.AK-47 Type 3(1952) - All rifles manufactured with a milled steel receiver.RPK - Handheld Automatic-Rifle variant with a longer barrel and a bipod.AKM - Modernized variant with various improvements over the AK-47.AK-74 series - Series of the AK-type rifle which replaced the AK-47 in 1978. Chambered in 5.45x39mmAK-101/AK-102/AK-103/AK-104 series - modernizations of the AK-74AK-107/AK-108 series - incorporates a balanced bolt group, reducing muzzle jump, vibrations, and felt recoil.",
  "example": "The Avtomat Kalashnikova model 1947, or AK-47, is the single most prolific assault rifle ever created, second to none, although the rifles quality is questionable.",
  "contributor": "Herr Jaeger"
}
{
  "word": "Ariana",
  "short_desc": "ariana A girl prettier than anyone she knows. Every guy flocks to her, but she acts like no one likes her, when really every guy who has met her falls in love. Ariana is like a diamond, the sun, dresses, and sunflowers. She is everything pretty and sweet smelling.",
  "meaning": "most amazing girl you will ever meet, an amazing girl who will be your best friend for Life! you could NEVER REPLACE HER. She has a big and cutest ass ever. A person you cannot get out of your mind, has beautiful eyes and a smile that makes someone fall in love, also a very simple girl, she can be very irritant. She can also be the BEST GIRLFRIEND EVER, she will be the kind of girlfriend who will love you more than anything, she will make you happier, an Ariana also heals a broken heart, she will do anything to make you smile and wouldn’t cheat or replace anyone even if she got paid, she doesn't need expensive jewellery ect the simpler the better it is for an Ariana,she is the girl that will always know when someone is not ok regards if she is with them or not, and most of the times she doesn't even try and she can make someone's life better, if you know an Ariana make sure you appreciate what you have because everyone in the world should have someone like her in their lives.",
  "example": "Guy : I think every broken hearted person should have an Ariana in their life either as their best friend or girlfriend.123 : I agree i had a broken heart because my ex cheated on me, but once i met my girl (ariana) my heart is like new there is no way to explain how she completes my life and makes my day worth it, i love her to bits.",
  "contributor": "LolLol9"
}
{
  "word": "Ani",
  "short_desc": "Ani Referring to multiple anuses, typically used as in the place of asses",
  "meaning": "A hilarious person. Ani is the life of the party. Though a bit introverted, Ani is very popular. Ani can get along with almost anyone, making her desirable to be around. Ani is known to have a heart of gold and is kind, pretty and free-spirited. Ani is also known to be a creative and can typically do anything artistically the first time it is done.",
  "example": "Ani is my pillar strength; Ani is good at music, dancing and prancing. I can't wait to go to Ani's house and eat cheese.",
  "contributor": "retsisymevol777"
}
{
  "word": "ATM",
  "short_desc": "ATM At the moment.",
  "meaning": "ATM is an abbrieviation that has several common meanings:1: At The Moment: Used when refering to one's current temporal circumstances.2: Automated Teller Machine: A machine that dispenses physical currency and performs the role of a bank teller.3: Ass To Mouth: A sexual act commonly featured in hardcore pornography where a penis, sex toy or other implement is removed from a person's anus and re-inserted into their mouth. Not to be confused with anulingus.",
  "example": "1: \"Sorry, I'm busy ATM.\"2: \"There was quite a long queue for the ATM.\"3: \"He pulled out of her asshole, and she turned around to clean off his member with some ATM.\"",
  "contributor": "kPMg_O4"
}
{
  "word": "Ali",
  "short_desc": "Ali A Best Friend, someone that you know you can always rely on through anything and everything. you know that your ali wont ever desert you and will always be there for you to talk to, you can tell your ali absolutely anything. Your ali should only be YOUR ali if you can trust them with your life, if you would do anything for them and if they mean the world to you, a best friend that you couldn&apos;t live without and who you never want to loose.",
  "meaning": "Ali is witty, sarcastic, snarky, argumentative, stubborn, cheesy, sweet, thoughtful, dependable, funny, kind, and generous. His memory is impeccable. Ali brings you into his world and makes it a place you want to be in. His interest in your day, your thoughts, and your dreams is genuine. Ali accepts you, all of you. Every moment with him is an example of his confidence in you. Ali makes you feel sure, certain, and calm. He helps you become the person you want to be. He's the one with whom you want to start and end your day.",
  "example": "Ali: hi\rMe: hi",
  "contributor": "thenthanthenthan"
}
{
  "word": "Angelina",
  "short_desc": "Angelina A very funny, outgoing, smart, pretty, crazy, and at moments a &quot;blond&quot; per say. She loves everything about life and lives it to the fullest, she also loves to argue and knows how to get her way. She&apos;s a great friend when you need her, and if you&apos;re not nice to her, then she won&apos;t be mean to you, she&apos;ll just smile and blow it off. She&apos;s so pretty and sweet. And Angelina is someone who is so envolved in her friends and family and would do anything for them. She&apos;s so beautiful too. If she&apos;s having a bad day, you&apos;ll know it, she will get snappy and mean but she&apos;s easy to forgive.",
  "meaning": "Talking to her always cheers you up. She tries to be what she sees as \"good enough\" because she only sees herself as less than. She's one of the most caring people you'll meet, fights for her friends, but forgets about her own feelings. She's always giving advice to friends and listening to them without even thinking about her own feelings or problems. She feels like a burden when she talks about her feelings so instead, she prefers to smile and act okay. Everyone takes her self-degrading jokes lightly, but few know how insecure she truly is. Most people take her jokes lightly, and only worry sometimes. She tries to only trust a few people because she's scared of being attached and then being left alone. She knows she has friends who are always there for her, but she still thinks she has to fight her battles alone. She tends to have sudden periods of depression and pure sadness, where she smiles even though she's a second away from shattering. She fights for what she believes in and for everyone she loves. She can be a bit impulsive, but that's just her being silly. Her heart is fragile, and she loves all her friends. She would rather be in pain forever rather than watch one of her friends suffer. When she truly falls, she falls completely without looking back. She falls for the wrong guys and seems to always end up crying. She always puts too much faith in people and can be a little too forgiving and naive in her own ways.",
  "example": "I thought I heard Angelina crying in the bathroom today.\rCan't be, she was laughing and smiling all day.Angelina's so lovable.",
  "contributor": "WinnieTheePoo "
}
{
  "word": "anti-vaxxer",
  "short_desc": "anti-vaxxer A particularly [toxic] kind of [narcissist] who places their own [science illiterate] beliefs in [woo] over the welfare of their own children and that of the general population.",
  "meaning": "Someone who discounts scientifically valid medical research pertaining to vaccines in favor of data produced by a discredited researcher.",
  "example": "The anti-vaxxer movement has negatively impacted herd immunity and resulted in outbreaks of presentable diseases.",
  "contributor": "Zyndell"
}
{
  "word": "Annie",
  "short_desc": "annie greek name: (meaning) gorgeous, kindhearted, rebelious, gentle towards others.",
  "meaning": "a girl who is on the whole great. She is tough, she is all about feminism and girl power and she isn’t afraid to argue her point. But on the other hand she can be sweet and caring too. She gives out really good advice and acts motherly towards others. She can also nag too for the sake of your own good. Shecan be annoying sometimes too. On the whole her looks are unique. Different. She always has something nice to say.",
  "example": "I need some advice!\rGo to annie , she’ll help",
  "contributor": "Lindsey2200"
}
{
  "word": "Angie",
  "short_desc": "Angie  Claims to be anti-social but is the exact opposite. Very beautiful and one of a kind personality. Has fun just about all the time and can make you laugh when you least expect it. Enjoys playing halo and can kick ass in Guitar Hero 3. Has amazing talents with her mouth and can do just about anything with it. Most spectacular/lovable person you could ever meet. ",
  "meaning": "Angies are rare . They are really funny and random and fun to be around. They love listening to music and blocking out the people they hate . Angies are quite if you dont know them but are very talkative once you get to know them . They will laugh and wont stop untill theres tears coming out of there eyes . They are really private and tend to keep most things to them selves they say they dont have any crushes but they secretly do . They know how to fight and i wouldnt mess with them when there mad . They love there family and friends and they are very protective . Angies tend to get Wrapped up in there thoughts but all in all they are really funny and random and loving .",
  "example": "Angie was walking down the street",
  "contributor": "Angiezzzzzz"
}
{
  "word": "Ally",
  "short_desc": "Ally The girl who knows how to party lika [rockstar]",
  "meaning": "Ally is a girl that is so incredible, a description can't be put into words. A person who is so completely selfless it's almost ridiculous. A person who is so beautiful both inside and out. A person with a heart bigger than Texas. A person who is so deep that she can make you contemplate your entire being with just one sentence. A person who has a certain enjoyment of donuts and Milkduds. A person who is extremely thoughtful and kind. A person so loyal and honest. A person you should make your girlfriend...in a hurry. Ally's are not basic at all and are one in a million kind of girls. Treat them right and don't take them for granted.",
  "example": "OMG that girl is so beautiful who is she?\rThat's Ally.",
  "contributor": "Donuts2425"
}
{
  "word": "ACE",
  "short_desc": "Ace Asexual to any degree. Using &quot;ace&quot; for &quot;asexual&quot; gained popularity on AVEN (www.asexuality.org) and has inspired the use of the spade as a symbol of the asexual community. ",
  "meaning": "someone who is really close to you.\rsomeone you can relate to.\rsomeone that you can easily talk to.\rsomeone who listens.\rsomeone who really care for you.\rsomeone who share the same interests.",
  "example": "THAT'S MY ACE!I LOVE MY ACE!",
  "contributor": "MYKE BEZZY"
}
{
  "word": "awesome",
  "short_desc": "awesome Something Americans use to describe everything.",
  "meaning": "Something Americans use to describe everything.",
  "example": "Oh wow it's just awesome",
  "contributor": "Every Strangers Eyes"
}
{
  "word": "AIDS",
  "short_desc": "AIDS A very dangerous disease that currently can&apos;t be cured. It will destroy your immune system until even a cold can kill you.   Contrary to what most of these homophobic twelve-year-olds added as the definition, AIDS can be aquired through any form of sex with a carrier. In fact, you don&apos;t even have to have sex. Just sharing blood or drinking breastmilk (This applies to everyone, not just babies) can give you AIDS.",
  "meaning": "Something you get from putting your dick in shit because you're too fucking poor to afford a single condom.",
  "example": "I forgot my condom when I fucked my bitches and they gave me AIDS.",
  "contributor": "TrumpisDad"
}
{
  "word": "Alice",
  "short_desc": "Alice isn&apos;t defined yet.",
  "meaning": "A caring, beautiful person who puts other people before herself. She can make you smile on the darkest of days, she gorgeous and anyone would be lucky to have her.",
  "example": "I'm so lucky to have Alice, I will never leave her side",
  "contributor": "Purpledreamygirl "
}
{
  "word": "Aaliyah",
  "short_desc": "aaliyah She was one of the best singers and also most beautiful girl ever but then it all ended by her tragic death on a plane crash.  she will always be on everyone&apos;s heart and unlike britney spears she sang real music. if she would be alive she would kick all those fake ass bitches ass like Britney spears.",
  "meaning": "Aaliyah is a beautiful woman, one that will make your head turn and have you staring at her for an eternity. A smart and wise girl as well, she can tell if you like her (and will finish your sentence when you proceed to tell her how you feel). Very funny and different from the rest, that's what makes her attractive, aside from her beauty. She might have a past or a history, that's what makes her who she is. She's the kind of girl you want to marry, and spend the rest of your life with, because the relationship you have with her is so great and amazing. A girl you can hold and kiss all day, you better keep her and prove your worth or else some other man will.",
  "example": "Malcolm: Yo, I know Aaliyah and I are great friends, but I really want for us to be more than that....I think I love her.Sam: Yeah, you and her are always making fun of each other or having a lot of fun, that's amazing. Do you really care for her?Malcolm: Yeah, I really do. I want to show her, but I feel like I can't. She has that history with that other guy, but I just know he can't do it like I can.Sam: Show her then; prove your worth.",
  "contributor": "ADallasCowboy"
}
{
  "word": "Andy",
  "short_desc": "Andy a man who&apos;s amazing in bed, great hair, and a smile that makes you melt. he&apos;s amazing all around.",
  "meaning": "One who has a fiery temper and no tolerance for BS\rWho also keeps their emotions inside until needed then its a nuclear explosion.\rA good friend but will insult you if he feels like it.",
  "example": "person one: \"Here comes Andy.\"\rperson two: \"Huh?\"\rAndy (to person two): \"Derp\"",
  "contributor": "POW"
}
{
  "word": "assclown",
  "short_desc": "Assclown One, who, through the fault of his parents conception, is a skid mark in society&apos;s collective underwear.",
  "meaning": "someone who doesnt know what the hell they are talking about,makes stupid BS comments, pisses people off, and has no idea that everyone thinks this about them.",
  "example": "see google image \"assclown\"",
  "contributor": "stesh"
}
{
  "word": "avril lavigne",
  "short_desc": "avril lavigne A singer that is so talented and clever, that she has the ability to rhyme &quot;home&quot; with &quot;home.&quot;",
  "meaning": "A singer that is so talented and clever, that she has the ability to rhyme \"home\" with \"home.\"",
  "example": "Avril Lavigne: \"She want's to go home, but nobody's home.\"\r\rGreat job Avril, great job.",
  "contributor": "seth_cohen_fan"
}
{
  "word": "Arianna",
  "short_desc": "Arianna Arianna, a more unique name, originating from the Lost World.  People with this name are literally worshipped by their offspring and friends.  Often times there are moments where you will get flashbacks with Arianna, due to their repetitive quote, &quot;Remember that one time...?&quot;",
  "meaning": "She is the girl of your dreams. She is very smart and an outgoing and adventurous person. If u have a chance to have a friend like her or anything else don’t lose them. She comes off very shy but, she will blow your mind away. She is one of the prettiest girls you’ll ever meet. She is funny,pretty,smart,cool,a goofball. She hates fake people and drama. She might not like the hottest guy or the popular guy but likes that one guy who is weird but cool.",
  "example": "Man Arianna is very pretty",
  "contributor": "Little lissha"
}
{
  "word": "Autumn",
  "short_desc": "Autumn Autumn is a very exotic type of female. She has a mystery to her which people love. She tends to be flirty but never easy. She knows her boundaries and has a great intuition.",
  "meaning": "Autumn what is the name definition? It's a definition of a beautiful girl with gorgeous perfect brown golden shining amazing eyes also just her face is a master piece a beautiful thing you could only experience once in a life time it's so perfect that damn you'd think she's born from angels. Her personality she is funny, goofy, smart, talented, lovable, loving, caring, and so helpful, she does whatever she can for her lover or the person that she had love for that's what makes her such an amazing person because that's one of the things you'd experience to fall in love with her. Her herself she just a perfect amazing shining star, born from angels, she's a goddess of perfection and will never compare to anyone you'd ever meet she's a once in a life time so if you ever meet her treat her like your going to die tomorrow, like it's your last dollar, like of she's a perfect beautiful diamond; cause she is, but also like if she was the only person you had left that's how much she will make you fall in love with her that's how perfect she is that is what's called Autumn. There is many words to describe her but those words aren't even close to her perfection.",
  "example": "Him: Hey you still with Autumn?\rBF: yes duh why wouldn't I be she's the love of my life.",
  "contributor": "Jaymister117"
}
{
  "word": "Avery",
  "short_desc": "avery avery means amazing, talented in every way , able to sucseed, will go far in life, loves and cares for that one special person, very good at basketball",
  "meaning": "An Avery is a person who is someone who can be defined by these words: gorgeous, outgoing, funny, awesome, crazy, dumb, the most amazing best friend someone can ever have. This person is usually sarcastic a alot, but that is what makes her funny and just makes her, her. She loves the colour purple and yoga pants. She does not think she is pretty but in reality she is the most attractive and beautiful thing to walk this earth. She is usually the prettiest and most popular one in the school, but fails to realize this. She has lots of friends, but makes sure that the ones most important in her life are valued most (her bestfriend and boyfriend). She is a flirter but is so faithful, and she also is a crazy partier and everyone loves her!",
  "example": "Dude #1 \"I met the most amazing girl today, she made me happy just by looking at her. And she just has this awesome flow to her that just makes me want to always be next to her.\"\rDude #2 \"by chance was this girl named Avery?\"\rDude #1 \"How the hell did you know that?\"\rDude #2 \"Because what you explained fits an Avery perfectly\"",
  "contributor": "yeslek_12"
}
{
  "word": "Alexa",
  "short_desc": "Alexa The most funniest and most amazing loving and caring person you can ever meet and be friends with ever in your life. Maybe even more than friends if you truly care for her.",
  "meaning": "She is the most beautiful girl you'll know, she's really funny and down to earth, she has an amazing personality that you can't find anywhere else, she's caring, intelligent, beautiful, cute, hot, awesome, smart, lovable, pretty, incredible, fantastic, fun, weird, outgoing, gorgeous, breathtaking, amazing, and perfect, she fights for what she believes in, she makes you feel happy, she has a fun crazy side and a fun lovable side, she's everything a guy could want and more and if you have the chance to be with her treat her like no one matters",
  "example": "Alexa is beautiful",
  "contributor": "Unknowncaller"
}
{
  "word": "Alexandra",
  "short_desc": "alexandra One of the best friends you could ever meet. Sometimes quiet and patient but when she&apos;s around a group shes wild and fun. She is always there to listen to you and give you a hug if you  need one. She is willing to try anything and is very athletic. She can talk for hours or just have no idea what&apos;s going on. She is an overall great person to be around.",
  "meaning": "Usually a girl's name. She's one of the strongest people you'll ever meet. She is the most patient and caring person you could ever meet. She deserves more than she has, so spoil her. She is the most beautiful person you'll ever meet. She is worth every second of your time, and you'll never regret staying up all night with her. She'll change your life, making it the best you could want it to be. She can make you smile just by smiling herself. You'll disagree at times, but you'll both apologize the next day. You could talk for days about how amazing she is. When you don't see them for a while you may go insane. Once you get to know her, you'll feel protective of her. She is not a snobby person, and never will be. She is nice to people who deserve it. She has random bi-polar moments that make her that much better. You could talk to her for hours about anything with her. One way or another, she finds a way to keep you out of trouble. She will always say something negative about her appearance even though she always looks beautiful. Always remind her she is beautiful. IN the worst of times she will be happy. She won't admit at first, but she is like every other person and has problems, and just needs someone to talk to. You just have to be there for her. You will never be able to describe her because there is so much to talk about. If you ever meet an Alex(andra), keep her close. She's is worth everything. You'll want to be with her forever.",
  "example": "Guy 1- i took an Alexandra home last night.guy 2- Dude, treat her right, she deserves it.",
  "contributor": "Robbykal"
}
{
  "word": "alicia",
  "short_desc": "alicia A beautiful girl who’s smart, honest and gentle, but she can also be aggressive. She likes to make random noises. She has eyes that sparkle under the light and sometimes change colour but are usually green. She loves chocolate. She rarely feels fear, she has rosy cheeks and always seems to have a gorgeous smile on her face. She’s not afraid of her sexuality. Although her hands always seem to be cold her heart is very warm, and her kiss gives a feeling like no other.     ",
  "meaning": "You'd think you know her, but you actually don't. Her face is very misleading to her personality. She's very pretty, especially when she smiles. She's very good at sensing vibes and many would call her unique or weird. She likes art and hates mainstream. She is either really lazy or really motivated. She can be really spontaneous but she is very down to earth. You wouldn't want her on your bad side however. And if you're on her good side (which is easy to do), then luck you! She is a giver. She always has cold hands, but her touches are always warm. She believes in experience. She never ever judges but fears of being judged. She enjoys time of serenity as well as times when she can just go full out. She is constantly questioning decisons and is always searching for the real her. She has long hair, ususally dark or black, but with random browns in it. Her eyes are like dark chocolate, and they get very small when she laughs. She has a soothing, low voice. She lacks confidence. She's attracted to shy guys, but get along very very well with outgoing guys.",
  "example": "Hahah only Alicia :')\rAlicia is addicting\rShe's quirky",
  "contributor": "brazilla908"
}
{
  "word": "attention whore",
  "short_desc": "attention whore Label given to any person who craves attention to such an extent that they will do anything to receive it. The type of attention (negative or positive) does not matter.",
  "meaning": "Label given to any person who craves attention to such an extent that they will do anything to receive it. The type of attention (negative or positive) does not matter.",
  "example": "You're such a GD attention whore!",
  "contributor": "Jonny_B"
}
{
  "word": "American",
  "short_desc": "American Technically, an American is someone from the Americas - i.e. North or South America. However, it is so commonly referring to people from the USA that we&apos;ll just ignore that point for now.  An American is someone who lives in the USA. Not all americans are overweight, ignorant pricks with an addiction to burgers and flag waving. Some of them are actually friendly, intelligent people!  Remember, kids: just because meet or hear one person from a certain place doesn&apos;t mean that everyone from there is like it. Oh, and did I mention that the actions of the US government don&apos;t ALWAYS speak unanimously for every last citizen of the USA? Just wanted to clear that up.  They do think some wierd things, though.. They call football soccer, American football football, aluminium aloominum, jam jelly and so on. But belittling them for differences like that would be a bit petty of me, wouldn&apos;t it?",
  "meaning": "Technically, an American is someone from the Americas - i.e. North or South America. However, it is so commonly referring to people from the USA that we'll just ignore that point for now.\r\rAn American is someone who lives in the USA. Not all americans are overweight, ignorant pricks with an addiction to burgers and flag waving. Some of them are actually friendly, intelligent people!\r\rRemember, kids: just because meet or hear one person from a certain place doesn't mean that everyone from there is like it. Oh, and did I mention that the actions of the US government don't ALWAYS speak unanimously for every last citizen of the USA? Just wanted to clear that up.\r\rThey do think some wierd things, though.. They call football soccer, American football football, aluminium aloominum, jam jelly and so on. But belittling them for differences like that would be a bit petty of me, wouldn't it?",
  "example": "While playing a game, I once met an American who was a mindless, stereotyping, bigoted, ignorant prick. But did that make me hate all Americans? Well, yes. But eventually I got over it. I would like to find that guy and cave his skull in, though..",
  "contributor": "do I have to put something here?"
}
{
  "word": "Australia",
  "short_desc": "Australia The best fuckin&apos; country in the world, Australia, is also the only place where Christ could never have been born, as in Australia, you cannot find 3 wisemen and a virgin.",
  "meaning": "The best country ever with the best people and, most of all, the best Cricket team. The best game comes from there (Aussie Rules) and nobody (other than the english cricketers that they always flog in the ashes) hates Australia",
  "example": "AMERICAN: Dude, I wish I lived in Australia because they are all epic\rKIWI: Nah, they just stole our fush and chups\rAUSSIE: Mate, we didn't steal it, we just re-invented it and gave it the correct pronunciation",
  "contributor": "BMX Hazza"
}
{
  "word": "asshat",
  "short_desc": "asshat One who has their head up their ass. Thus wearing their ass as a hat. Asshat",
  "meaning": "One who has their head up their ass. Thus wearing their ass as a hat. Asshat",
  "example": "",
  "contributor": "Anonymous"
}
{
  "word": "Adrian",
  "short_desc": "Adrian A hot ass guy that is strong and smart. Trys everything to keep a relationship from failing and is good when it comes to listening and talking (not to girls). Also know best for his abilities and experience in bed. A great friend and the best boyfriend to be with. On the other hand not the best person to mess with because he can fight. Adrian for some reason cannot hold a grudge for little things, but can and will not let it go if it horible. Even if he says he got over it (he really didn&apos;t). Another thing is once he likes someone he wont move on til he gets that person or he finally accepts that he is never going to get her. BUT just give him a chance... he may just be the best thing thats ever happen to you.",
  "meaning": "Adrian is the most amazing person you will ever meet. He will make you smile even if you have had a hella hard day.\rHe will always have your back no matter what. All the girls like him and you will be very lucky to be his friend. He will do anything to keep a relationship and will kick someones ass if you mess with him or his friends. Loyal, smart, funny, and kind. An Adrian is about everything you can ask for. He also has hot - ass hair!!",
  "example": "Girl 1 : hey have you seen that boy over there?\rGirl 2 : Yeah he is my best friend, Adrian.\rGirl 1 : I wish i was his friend!!",
  "contributor": "ImNOTStalkingYOu"
}
{
  "word": "Abigail",
  "short_desc": "Abigail A super-sweet girl. Extremely gorgeous and tons of fun. When you meet one you will want to be a huge part of her life but you would have to be very lucky for it to happen. An Abigail will stay on your mind forever so you will know when you meet one.",
  "meaning": "A Best Friend who understand everything about everyone, the most amazing person you'll ever come across, beautiful funny, talented, clever. Gets on with everyone yet chooses to have the weirdest people as best friends because deep down she is a insane crazy child! Secretly has alot of problems that she doesnt want anyone to know but ends up telling some one or another because her best friend knows her too well. She is very strong and would rather see others happy than be happy herself. Happiest when singing or acting and playing the piano. And All Round Amazing Person...",
  "example": "Abigail is amazing",
  "contributor": "Freddieee1234"
}
{
  "word": "Angela",
  "short_desc": "Angela The name Angela is given to people who are kind and sweet to others. She is very friendly and easy to get along with. Amazing personality. Sometimes sadness can get the best of her but to see her smile is like having the sun shine bright. But watch out just because she is fun and nice doesn&apos;t mean she can take care of herself she will put you in your place fast. She has the most amazing dark wavy hair and mysteries eyes. She can be hard to read at times but don&apos;t worry she is very trust worthy. She is smart, hard working, and a all around good person. She is also a friend to the four legged furry creatures. She is a friend to all.... :)",
  "meaning": "A beautiful, strong capable woman. She is very smart and she has the most gorgeous, sparkling eyes. She is shy when you first meet her but once you take the time to get to know her she is quite fun to be around. She will never usually make the first move to talk to her crush as she is too shy but will start talking once her crush takes the time to talk to her. Angela is a girl who will stand up for what is right and won't let anyone get in her way. She also really loves sloths.",
  "example": "Person 1: woah, who's that girl who just walked in? She's stunning!\rPerson 2: that's Angela. If you like her you better make the first move.",
  "contributor": "Mr magic man"
}
{
  "word": "Ana",
  "short_desc": "Ana A beautiful girl, she&apos;s never sure of what she wants hates commitments. There isint a person in the world that doesn&apos;t enjoy talking to her. Guys are the main thing In her life, she gets attached easily but can get over a guy in a few weeks. She doesn&apos;t like having an &quot;owner&quot; she flies her own way. Her smile can brighten your day anytime, she is always laughing, and is easily pleased. She always wants what she can&apos;t get. She has big expectations, and always expects the unexpected.",
  "meaning": "Ana is a very caring friend. She is always there for you and you can trust her with your life. She is the most incredible person you'll ever meet ans she is also very funny. She has a childish style that will cheer you up whenever you feel bad. Ana is a sensitive and very beautiful girl. She is always full of joy and ready for a new day. She is just charming!!!!❤️❤️\rShe is the most wonderful friend someone can dream of and she MUST know that she is very loved by her best friend.",
  "example": "Ana Bananna🍌",
  "contributor": "Lifey"
}
{
  "word": "abercrombie",
  "short_desc": "abercrombie A clothing store that is so expensive that gift certificates make you pay extra for the clothes you buy. The company will, in many cases, &quot;pre-wrinkle&quot; the shirts for you. Jeans can also be purchased with a holes already in them. The clothes feel, oddly enough, like they&apos;ve already been used.",
  "meaning": "The type of clothing worn by Aberzombies, a peculiar specimin which infest college campuses and upscale suburban high schools across the North American landmass.  \r\rNominally a human being, the Aberzombie is easily identifiable by large advertisements worn on its chest and buttox.   It tends to come from wealthy stock, drives an SUV and mates exclusively with other Aberzombies.  \r\rThe musical taste of the Aberzombie is limited to bands like Dave Matthews and O.A.R.  Its SUV is typically emblazoned with a sticker reading \"DMB\" so as to communicate its bland taste in music to potential mates.  \r\rThe Aberzombie is not without its natural enemies, however.  Most prominent among them are independent thought and a sense of style.  The Aberzombie will go to great lengths not to face such horrific ideas, most often by associating only with fellow Aberzombies.  In the rare case that it is exposed to outside ideas/free thought, it will utilize its only defense mechanism: complaining that others are envious and simply cannot afford Abercrombie clothing.",
  "example": "Dude, my dad owns a dealership!",
  "contributor": "Kim Jong-Il"
}
{
  "word": "Abby",
  "short_desc": "Abby  The girl who always has a good time. The girl who is always making people laugh, and who is easily loved. The girl who is beatiful on the inside and the outside. The girl has slammin hips. The girl whose dedicated, and has a rockin family. The girl who is the best best friend ever, amazing all around!!",
  "meaning": "She is a very insecure girl. She doesn't know how amazing she is. She is very pretty. Dropdead gorgeous. She is super nice and everyone loves her. She is an angel. And she is ultra funny. She always tries to lighten up everyone's mood and she succeeds. She can make anything seem funny. She makes everyone around her happy. She carries a warm aura with her. Everyone wants to be her friend; all the girls want to be her and all the guys want her. But despite all the compliments she gets everyday, she is always secretly broken inside.",
  "example": "Guy 1: \"She is totally an Abby.\"\rGuy 2: \"Yeah. She's amazing. I wanna get her number.\"Girl 1: \"OMG, she is gorgeous!\"\rGirl 2: \"OMG, yeah, I want to be her!\"",
  "contributor": "Heather12345"
}
{
  "word": "Allison",
  "short_desc": "Allison coolest bitch on the block",
  "meaning": "A gorgeous girl who doesn't know how beautiful she is.She's shy, but once you get to know her, you'll be glad you did.Has her own style.Is just herself, and won't change anything about herself for anyone else.\rShe is nearly impossible; she can’t ever make up her mind.All the boys that know her, fall for her.....hard.And when she falls, she falls hard, and has a tough time getting back up.Some one who cares about everyone else before herself, even though she's the one who needs the most help.Has been through a hell of a lot, but brushes herself off and puts on a smile every day:)Some one YOU should get to know",
  "example": "Allison is a girl that is amazing!",
  "contributor": "Deffintition of a name.."
}
{
  "word": "Aiden",
  "short_desc": "Aiden Makes everyone smile where ever he goes. Will be remembered by many. Has a charming caring personality",
  "meaning": "a Fun-loving, intellectual individual. He is mostly an introvert but has some very extroverted moments. Aiden's are known for having a good sense of humor, but not knowing when to use it. Aiden is a very smart and kind person who always puts others before themselves. If you need a good friend, look for an Aiden. Not Aidan or Ayden though, those guys are dicks.",
  "example": "Aiden is so funny!\rAiden is so smart!",
  "contributor": "NKpel"
}
{
  "word": "Abercrombie and Fitch",
  "short_desc": "ABERCROMBIE AND FITCH Overpriced clothing, no different from any other cotton shirt or denim jeans. A company that is trying to sell a pathetic image while brainwashing teens into slapping down $60 bucks for a shirt. Is there some kind of &quot;special material&quot; or &quot;quality&quot; that these shirts have? No, foolhearted children, its just the big fat aberslobby logo that was crudely stamped on by the same malaysian sweatshop worker who made my shirts that I found for 7 bucks. If you think that you feel more comforable in some rags that scream &quot;look at me, I&apos;m rich and pay 60 bucks for a shirt&quot; then you are quite a materialistic person. The store&apos;s always blast a thumpin&apos; beat that disgraces any kind of music. They wouldn&apos;t want to play anything that would &quot;turn away&quot; any A&amp;F mind jobs and their daddy&apos;s fat wallets. Notice all the people that shop there all fit the same type of mold. Rich, materialsitic, dumb, blonde girls, and rich, prep/fag, &quot;popular&quot; guys. I guess all of the money that A&amp;F has been sapping from teens has been put into very good marketing, To bad it wasn&apos;t accutually going into making a better product, in to which it should be.",
  "meaning": "You're nothing if you're not Perfect...",
  "example": "First off, I used to work as an in store model in the London store of Abercrombie and Fitch. I didn't go for the job because i loved the store or the clothes(actually i'd never even been in!), i got scouted and thought i'd have a go as i need some extra money. At the interveiw/casting we had our pictures taken and then sat in a group and were asked questions. One of which was \"why do you think diversity is important in the work place?\"i answered the question and didn't give it another thought until I got the job and went for the training day. We sat in a small room waiting to start and i look around. Every single girl in the room was over 5'8\", thin and gorgeous. Every guy was muscular tanned and very attractive. As the day went on and the rules came out it got more and more clear that they didn't want even the tinest bit of diversity. They have a mold and the expect you to stick to it. Everyday before you work you are checked by the \"visual\" team. If they deem you unfit to take the floor, you get put in the stock room underground. I completely agree with some of the people saying \"it's just a store! let people wear what they want!\" but at the end of the day it's not. It's a brand image that makes kids believe you're nothing if you're not perfect.",
  "contributor": "Cassie A"
}
{
  "word": "Amelia",
  "short_desc": "Amelia A crazy, awesome, loud, lovable girl. Impossible not to be smiling when around her. She lights up the entire room when she comes in. The bestest friend you will ever have.  Sometimes known as Mia or Millie.",
  "meaning": "Amelia is a smart, loving, caring girl. When you first meet her she seems very shy but as you get to know her she becomes loud and confident. She likes to keep her most valuable secrets to herself. If you have an Amelia in your life don't let her go. She has a lot of things going on at home but tries to hide it when she's out. She is a great advice giver but scared to ask for advice. She is loyal. If you get on her bad side you'll regret it.",
  "example": "Popular Girl: Tell Amelia to back off!\rGirl: You wouldn't want to get on her bad side\rPopular Girl: I don't care!",
  "contributor": "ThatAnnoyingPerson"
}
{
  "word": "Andre",
  "short_desc": "Andre A man who lives on bullshit because whatever he is does not seem good enough.",
  "meaning": "They tend to wear their trousers low....showing a hint of their white shorts that they mysteriously want girls to look at! yesss were looking...put them away..your not black! Also refer to themseleves as Alan! Should change name to Mr G-Star because he is rawwww. Loves attending regular meetings of the batb lehhhh!I think he may have some homo sexual feelings towards his fellow members! watch out tg! Where to find this specimen?.....dance nation in his tracky bs. \r\r\"SCOOOTTTYYYY\"\r\r\"Loveee it\"\r\r\"Tea and Biscuits...hobnobs...how fabulous\"\r\r\rWatch out ladies Andres about!!!!",
  "example": "Andre Alan Scott",
  "contributor": "Ilovedancenation"
}
{
  "word": "Anime",
  "short_desc": "anime noun:  a style of animation that originated and is still heavily centered in Japan.  The word &apos;anime&apos; is based on the original japanese pronunciation of the american word &apos;animation.&apos;  The stereotype of the anime style are characters with proportionally large eyes and hair styles and colors that are very colorful and exotic.  The plots range from very immature (kiddy stuff), through teenage level, to mature (violence, content, thick plot).  The classification of &apos;hentai&apos; is given to animes of a stong sexual nature.  Although over 95% of anime has nothing perverted about it, most closed-minded idiots think anime is always a form of pronography.",
  "meaning": "Japanese animation drawn in the same style as manga just animated. Often messed up by America.",
  "example": "Did you know Pokémon isn't the only anime?",
  "contributor": "Lemmondoggy"
}
{
  "word": "Amanda",
  "short_desc": "Amanda A women named Amanda is typically very beautiful with an incredible body and nice eyes. They are known to be very loveable. Amandas are envied by other women.",
  "meaning": "She who is worthy of love. Her smile, her eyes, everything about her is just absolutely breath taking. If you are ever lucky enough to meet an Amanda, be sure to keep her in your life. Amandas make perfect girlfriends and are very loving. Amandas are loyal, nice, and beautiful. She is a great person and is very very friendly to everyone. Amandas are very good looking too. Amanda is definitely the ideal girl of the world. Anyone would be dumb enough to let such an amazing and beautiful person go. You can easily lose an Amanda's trust by hurting her though, so just because she seems very nice, once she's hurt she can be a bit rude at times, but who could blame her? Amanda is the exact definition of what perfect is. Even though no one is perfect, Amandas surely are.",
  "example": "Wow, she is so beautiful, don't you think? Of course you do, she's an Amanda.\rI can't believe how amazingly gorgeous Amanda is.",
  "contributor": "everybodydotheflopbam"
}
{
  "word": "Aidan",
  "short_desc": "AIDAN Aidan , maddest cunt ever. all bitches . blow him ,",
  "meaning": "Aidan is the King of All, his power is immeasurable, he cannot be beaten, when god made him, god made him with the purpose to kill himself.He is more powerful than The Dainel.Shaggy fears him.He is the father of Matt.He has the largest dick.Has taken all virgins virginity. (Except guys, hes not gay)The supreme being of divine power.God among gods.",
  "example": "\"Oh no, Aidans coming. This is the end.\" - Thanos",
  "contributor": "Your mom 69 420"
}
{
  "word": "Atheist",
  "short_desc": "Atheist There are two in-use definitions of the word &apos;atheist&apos;:  1.) A person who lacks belief in a [god] or gods.  People who use this definition categorize atheists as either negative (or implicit or weak) atheists or positive (or explicit or strong) atheists.  Negative atheists, while they don&apos;t believe in a god, do not positively assert that no gods exist.  Positive atheists, however, do.  2.) A person who believes that no god or gods exist.  Those who consider themselves atheists (who are usually positive atheists) tend to define &apos;atheist&apos; using the former definition, and those who believe in a god or gods tend to define &apos;atheist&apos; using the latter.  In both cases, this seems to be a demagogic practice intended to classify either as many or as few people as atheists as possible.  Negative atheists are usually referred to as [agnostic]s.  While neither definition of atheism entails any personality traits of atheists or of those who do believe in a god or gods (sometimes referred to as &apos;[theist]s&apos;), both atheists and theists tend to believe that certain traits apply to all atheists/theists.  Common myths about atheists include: all atheists are arrogant, immoral, rebellious, and/or intolerant; all atheists really believe in (the Christian) God and are simply in denial; all atheists are depressed and believe life is meaningless.  Common myths about theists include: all theists are naive and/or intolerant; all theists don&apos;t really believe in their god(s) and just pretend to because they&apos;re afraid that if people realised that no god exists, there will be complete chaos; all theists are weak and look to their god(s) for comfort.  It hardly needs to be said that while these myths apply to a select few individuals in each group, the claim that they apply to every atheist or every theist is false.  Negative atheists justify their lack of belief in god(s) by pointing out that no evidence exists for the existence of god(s), and justify their lack of disbelief by pointing out that no evidence exists for the nonexistence thereof.  Positive atheists often assert that while no evidence for god(s) exists, it should be by default assumed that they do not, until evidence is found.  Some also try to use [logic] to prove that God does not exist, but this is often attached by theists and weak atheists as being mere wordplay.  Some theists and weak atheists also assert that logic is superficial and meaningless (which is an easily refutable claim), and that only one&apos;s inner feelings can lead them to truth.  Some positive atheists (and [deist]s), however, are led to their stance through their feelings.  Some feel that because the world is filled with evil and malice, and all-loving, benevolent god cannot exist.  Those who are led to their stance through this feeling, however, cannot justify their disbelief in a malevolent god in the same way.  Some reject the idea of the Christian God because the [Bible] states that non-Christians are condemned to [Hell], and reject the idea as being too disturbing.  While the same argument can also be made against the gods of various other religions, including [Islam] and [Zoroastrianism], it cannot be made against every god (in Judaism, for example, Hell does not exist).",
  "meaning": "There are two in-use definitions of the word 'atheist':\r\r1.) A person who lacks belief in a god or gods.  People who use this definition categorize atheists as either negative (or implicit or weak) atheists or positive (or explicit or strong) atheists.  Negative atheists, while they don't believe in a god, do not positively assert that no gods exist.  Positive atheists, however, do.\r\r2.) A person who believes that no god or gods exist.\r\rThose who consider themselves atheists (who are usually positive atheists) tend to define 'atheist' using the former definition, and those who believe in a god or gods tend to define 'atheist' using the latter.  In both cases, this seems to be a demagogic practice intended to classify either as many or as few people as atheists as possible.  Negative atheists are usually referred to as agnostics.\r\rWhile neither definition of atheism entails any personality traits of atheists or of those who do believe in a god or gods (sometimes referred to as 'theists'), both atheists and theists tend to believe that certain traits apply to all atheists/theists.  Common myths about atheists include: all atheists are arrogant, immoral, rebellious, and/or intolerant; all atheists really believe in (the Christian) God and are simply in denial; all atheists are depressed and believe life is meaningless.  Common myths about theists include: all theists are naive and/or intolerant; all theists don't really believe in their god(s) and just pretend to because they're afraid that if people realised that no god exists, there will be complete chaos; all theists are weak and look to their god(s) for comfort.  It hardly needs to be said that while these myths apply to a select few individuals in each group, the claim that they apply to every atheist or every theist is false.\r\rNegative atheists justify their lack of belief in god(s) by pointing out that no evidence exists for the existence of god(s), and justify their lack of disbelief by pointing out that no evidence exists for the nonexistence thereof.  Positive atheists often assert that while no evidence for god(s) exists, it should be by default assumed that they do not, until evidence is found.  Some also try to use logic to prove that God does not exist, but this is often attached by theists and weak atheists as being mere wordplay.  Some theists and weak atheists also assert that logic is superficial and meaningless (which is an easily refutable claim), and that only one's inner feelings can lead them to truth.  Some positive atheists (and deists), however, are led to their stance through their feelings.  Some feel that because the world is filled with evil and malice, and all-loving, benevolent god cannot exist.  Those who are led to their stance through this feeling, however, cannot justify their disbelief in a malevolent god in the same way.  Some reject the idea of the Christian God because the Bible states that non-Christians are condemned to Hell, and reject the idea as being too disturbing.  While the same argument can also be made against the gods of various other religions, including Islam and Zoroastrianism, it cannot be made against every god (in Judaism, for example, Hell does not exist).",
  "example": "\"Do you believe in God?\"\r\"No, I don't.\"\r\"Then you're an atheist?\"\r\"I suppose.  I don't believe God doesn't exist, so I could probably be called an agnostic instead.  Some atheists may consider me a 'negative atheist', though.\"\r\"Don't you think atheists.. er, would I call them 'positive atheists'?  Don't you think they're intolerant?\"\r\"Yes, you'd call them 'positive atheists', and no, I wouldn't say they're all intolerant.  While some may come off as arrogant, they're just unable to understand how you can believe in God; you probably come off as arrogant to them, also, because you're unable to understand how they can disbelieve in God.  People on both sides really need to make an effort to be more tolerant, and to discuss their stance on religion without using childish, immature insults.\"",
  "contributor": "Anonymous"
}
{
  "word": "aol",
  "short_desc": "AOL Now AOL is trying to control the music download business with a new service called &quot;MusicNet@AOL&quot;. It&apos;s bad enough that AOL censors content and keeps track of what you see, now AOL wants to keep track of what you hear.   Any song downloaded from the AOL MusicNet service contains DRM (Digital Rights Management) software code embedded in it. DRM is used so AOL and the RIAA can identify which AOL member is downloading which songs. If you don&apos;t believe AOL and the RIAA keep track of what you are doing online, you are a n00b. You obviously haven&apos;t read your AOL user agreement.  AOL sucks. Boycott AOL!",
  "meaning": "america online, the crappiest and laggiest shit internet users can use. also way too much spam",
  "example": "\"Welcome to AOL, You have new spam, dickhead.\"",
  "contributor": "Jason"
}
{
  "word": "Aaron",
  "short_desc": "Aaron In India &quot;Aaron&quot; is a slang word for pimp.",
  "meaning": "A hardworking dude with a great sense of humor. Best known for finishing jobs with pizzazz and pride, breaking tension with jokes and puns, and communicating with astuteness and heart. Aaron also is a master of hospitality, knowing how to make people feel welcome.Some people see Aaron as cynical and jaded, and--to be fair--sometimes he is that. But under the surface is a beating heart that hopes and dreams, that sees beauty and light and feels deeply. Quick of wit and perception, Aaron is fun to talk with, and someone who provides thoughtful and stimulating conversation.Most of all, Aaron means someone who knows how to act according to his code of honor. He may not always voice his thoughts, but what he does say, he says because he thinks it right or funny, not to people please. He is a giver of compliments at times--not as a means of sucking up--but for the sake of making other people feel good. He is a warrior of heart, and acts from his heart.When life throws rough punches his way, he holds his footing, and keeps on going. He is loyal. One thing that holds him back is that he's been hurt and abandoned, and he struggles with trust and self-worth. But he is far more valuable than the finest precious metals or gemstones. One day he will realize his value and will know and receive the love and loyalty he has been craving. Til then, he suffers, believing the lies that he's not worth the effort and that he will always be alone and rejected.",
  "example": "\"If more people had heart, humor and hospitality like Aaron, the world would be a far better place.\"\"Aaron has a place in my heart forever. I love him dearly.\"",
  "contributor": "Belch Queen"
}
{
  "word": "Adam",
  "short_desc": "adam The first Man to ever get laid.",
  "meaning": "Adam, someone who is amazing without knowing it, someone who is easy to love, someone who is truely caring. Adam is the type of person who is so forgiving and loving...Someone who is so trustworthy and reliable. You would be lucky to have him in your life, and if you ever lost him, it would break your heart. He is the best friend you could ever have and you can't help to be in love with him. He is one of the most handsome guys you will ever see in your life, no matter what he says. He is someone you can make such happy and amazing memories with, memories you will never forget. He is someone that can leave you speachless with his words.. He is someone you know you aren't good enough for, but you can't help but love him with all of your heart anyways. He has such a big heart..and great soul. He is the kind of person that deserves the best in his life, and deserves to be loved and cherished.",
  "example": "Adam you are amazing. loving beautiful nice trusting",
  "contributor": "Alostperson"
}
{
  "word": "Anna",
  "short_desc": "Anna The name for the most awesome person ever, It is impossible to fit so much awesome into any other person.",
  "meaning": "Anna is a person who makes you appreciate life for what it is. She has a smile and a twinkle that will light up a room imediately. She is a puppy at the core and let's everyone know it. Anna loves people for who they are. She is beautiful understanding and funny. If you fall, then Anna will either fall with you, or be the soft hand to help you up.",
  "example": "You have never met a person like Anna",
  "contributor": "Matthew u"
}
